{
  "Blue_Shield_of_CA_00170": "Let:\nA = Dental general anesthesia is performed in a hospital, outpatient surgery center, or a dental office which has met the requirements established by the Dental Board of California for the provision of general anesthesia\nB = The dental procedure generally does not ordinarily require general anesthesia\nC = The patient is less than seven years of age\nD = The patient is developmentally disabled\nE = The patient's health is compromised\n\nThe algebraic expression for all the requirements to be met for the policy to be applicable is:\n(A) AND (B AND (C OR D OR E))",
  "Blue_Shield_of_CA_93228": "variables:\nA = patient-activated or auto-activated external ambulatory event monitors (AEMs)\nB = continuous ambulatory monitors that record and store information for periods longer than 48 hours\n\nalgebraic expression:\nA OR B",
  "Blue_Shield_of_CA_0446T": "Let:\nP = Continuous glucose monitoring (CGM) of glucose levels in interstitial fluid is medically necessary\nQ = Individuals with insulin dependent (type 1 or type 2) diabetes requiring multiple (three or more) daily doses of insulin\nR = The device includes an audible or tactile alarm for low glucose alerts without patient intervention\n\nThe algebric expression of all the requirements for this policy to be applicable using logical operators and variables is:\nP = Q ∧ R\n\nThis expression states that the policy is applicable (P) if both requirements Q (individuals with insulin dependent diabetes requiring multiple daily doses of insulin) and R (device includes an audible or tactile alarm for low glucose alerts without patient intervention) are met.",
  "Blue_Shield_of_CA_51925": "Let:\nA = presence, or the suspicion of, a malignancy is clearly indicated as the preoperative reason\nB = an emergent condition exists\nC = abnormal uterine bleeding criteria are met\nD = high likelihood of adenomyosis is present\nE = Chronic Pelvic Inflammatory Disease (PID) criteria are met\nF = Endometriosis criteria are met\nG = Leiomyomata (fibroid) criteria are met\nH = Pelvic pain criteria are met\nI = Pelvic relaxation (prolapse) criteria are met\nJ = Cervical Intraepithelial Neoplasia (CIN) criteria are met\nK = Preventive gynecologic surgical intervention criteria are met\n\nThe expression for all the requirements to be applicable is:\n(A or B or (C and D) or E or F or G or H or I or J or K) or (not unclear or not adequately documented) or (not robotic surgical techniques with separate payment requested)",
  "Blue_Shield_of_CA_77385": "Let's use logical operators and variables to represent the requirements for this policy to be applicable:\n\nLet:\n- A represent the condition of having left-sided breast cancer\n- B represent the condition of prior breast-conserving surgery\n- C represent the condition of significant cardiac radiation exposure\n- D represent the condition of reduced cardiac target volume radiation exposure \n- E represent the condition of having large breasts (>500 cc)\n- F represent the condition of hot spots in 3-dimensional conformal radiotherapy dosimetry\n- G represent the condition of being treated for lung cancer with curative intent\n- H represent the condition of exposing greater than 35% of normal lung tissue to more than a 20-gray dose-volume with 3-dimensional conformal radiotherapy\n- I represent the condition of reducing the V20 to at least 10% below the V20 achieved with the 3-dimensional plan in IMRT dosimetry\n- J represent the condition of close proximity to critical structures in breast or lung tumors\n- K represent the condition of planned exposure in 3D-CRT being above normal tissue constraints for critical adjacent structures\n- L represent the condition of planned IMRT exposure not exceeding normal tissue constraints for critical adjacent structures\n- M represent the condition of having the same or immediately adjacent area previously irradiated with abutting portals established with high precision\n- N represent the condition of met criteria for palliative treatment for lung cancer in IMRT\n- O represent the condition of previous treatment history meeting requirements\n\nPolicy Requirements expressed using logical operators:\nI. (A AND B AND C AND D)\nII. ((C AND D) OR Contraindications)\nIII. (E AND F AND Not F)\nIV. (G AND H AND I)\nV. Not (N)\nVI. ((J AND K AND L) OR M)\nVII. Not (A AND B AND C AND D AND E AND F AND G AND H AND I AND J AND K AND L AND M AND N AND O)",
  "Blue_Shield_of_CA_77386": "Let:\n- A = IMRT may be considered medically necessary\n- B = Dosimetric planning with standard 3-dimensional conformal radiotherapy predicts unacceptable normal tissue toxicity\n- C = IMRT is used to treat specific types of cancer\n- D = Target volume is in close proximity to critical structures that must be protected\n- E = Planned 3D-CRT exposure to critical adjacent structures is above normal tissue constraints\n- F = Planned IMRT exposure to critical adjacent structures does not exceed normal tissue constraints\n- G = The same or immediately adjacent area has been previously irradiated and abutting portals must be established with high precision\n- H = IGRT may be considered medically necessary as an approach to delivering radiotherapy\n\nThe algebraic expression for the requirements of the policy to be applicable would be:\n\n(A AND B) OR (A AND C AND D AND E AND F) OR (A AND C AND D AND G) OR H\n\nThis expression represents the combination of requirements for each condition specified in the policy statement using logical operators AND, OR, and parentheses.",
  "Blue_Shield_of_CA_43632": "Let's define the logical operators and variables first:\n\nLogical Operators:\n- AND (represented by ∧)\n- OR (represented by ∨)\n\nVariables:\n- A: BMI greater than or equal to 35 kg/m^2 or 140% of the 95th percentile for age and sex\n- B: BMI greater than or equal to 30 kg/m^2 (27.5 kg/m^2 for Asian individuals) with at least one clinically significant obesity-related disease\n- C: Individual has failed weight loss to a BMI less than required for approval\n- D: Individual has been evaluated for, and has received, maximal therapy\n- E: Individual has received a comprehensive psychosocial-behavioral evaluation\n- F: No tobacco smoking for at least 6 weeks prior to surgery\n- G: No ongoing alcohol or drug abuse or treatment within the past year\n- H: Bariatric surgery is performed by properly credentialed surgeons\n- I: Repair of a hiatal hernia at the time of bariatric surgery may be considered medically necessary\n- J: Repair of a hiatal hernia is considered investigational\n- K: Concomitant hiatal hernia repair with bariatric surgery is considered investigational\n\nPolicy Application Expression:\n(A ∧ B ∧ C ∧ D ∧ E ∧ F ∧ G ∧ H) ∨ (I ∧ J) ∨ K\n\nThis expression represents all the requirements for the policy statement to be applicable using logical operators and variables. Each variable represents a specific requirement within the policy statement, and the logical operators ensure that all conditions are met for the policy to be applicable.",
  "Blue_Shield_of_CA_15820": "Let:\nP = Proposed procedure meets definition of reconstructive surgery\nM = Procedure is medically necessary\nA = Procedure results in only minimal improvement in appearance\nD = Treating surgeon provides sufficient documentation\n\nThe algebric expression would be:\nIf P and [(A and M) or (D and M)] = Applicable Policy",
  "Blue_Shield_of_CA_93454": "Given the policy statement: \nP = \"Policy is not intended to address prior authorization of ICA for ACS or other high-risk situations.\" \n\nLet's define the requirements for this policy to be applicable using logical operators and variables:\n\nR1 = \"The patient has acute coronary syndrome (ACS)\"\nR2 = \"The patient is in a high-risk situation\"\n\nUsing logical operators:\nPolicy is applicable if: \n¬(R1 ∨ R2) \n\nIn words, the policy is applicable if neither R1 (patient has ACS) nor R2 (patient is in a high-risk situation) is true.",
  "Blue_Shield_of_CA_G6016": "I. A = (Planned 3D-CRT exposure to critical adjacent structures is above normal tissue constraints) AND \n    B = (Planned IMRT exposure to critical adjacent structures does not exceed normal tissue constraints)\n\nII. A = (Brain tumor metastases outside a 5-mm margin around either hippocampus) AND \n    B = (Expected survival of 4 months or longer)\n\nIII. Intensity-modulated radiotherapy is considered investigational for the treatment of tumors of the central nervous system for all indications not meeting the criteria above.\n\nIV. IGRT may be considered medically necessary as an approach to delivering radiotherapy when combined with any of the following treatments.",
  "Blue_Shield_of_CA_92920": " P policy.\n\nVariables:\n- ACS (Acute Coronary Syndrome) is true\n- P (Prior authorization) is true\n\nAlgebraic expression:\nP & ~ACS",
  "Blue_Shield_of_CA_27447": "Let's use the following variables and logical operators:\n- A: The reason for the arthroplasty is osteoarthritis (OA), rheumatoid arthritis, osteonecrosis, or post-traumatic arthritis of the knee joint\n- B: It is NOT for bicompartmental knee replacement, including bi-unicompartmental (two individual compartments in the same knee)\n- C: It is NOT for a customized knee replacement\n- D: It does NOT use focal resurfacing of a single knee joint defect\n- E: It does NOT use minimally invasive approaches to knee arthroplasty\n- F: The individual has one or more of the specified conditions\n\nThe algebric expression for all the requirements to be met for the policy to be applicable can be written as:\n(A AND NOT B AND NOT C AND NOT D AND NOT E AND F)\n\nThis means that knee arthroplasty may be considered medically necessary if the reason for arthroplasty is one of the specified conditions, it is not for bicompartmental knee replacement, not for a customized knee replacement, does not use focal resurfacing of a single knee joint defect, does not use minimally invasive approaches, and the individual has one or more of the specified conditions.",
  "Blue_Shield_of_CA_11920": " Let variables:\nG = Gender affirmation surgery is considered medically necessary\nD = Gender dysphoria is confirmed\nA = Individual is age 18 or older\nP = Policy applies to self-funded ASOs\n\nThe algebraic expression for the policy to be applicable can be represented as:\n\nG ∧ D ∧ A ∧ P",
  "Blue_Shield_of_CA_81201": "Let:\n- G = Genetic testing of the APC gene\n- M = Genetic testing of the MUTYH gene\n- L = Genetic testing of Lynch Syndrome genes (MLH1, MSH2, MSH6, PMS2, EPCAM)\n- S = Genetic testing of SMAD4 and BMPR1A genes\n- T = Genetic testing of STK11 gene\n- P = Panel testing (including APC, MUTYH, MLH1, MSH2, MSH6, PMS2, EPCAM, SMAD4, BMPR1A, STK11)\n\nThe policy is applicable if:\nG is necessary for:\n- A relative has FAP and/or APC variant\n- Personal history of 20 or more adenomas\n- Personal history of 10-20 polyps with specific criteria\n- Included in an approved small genetic panel\n\nM is necessary for:\n- A relative has MUTYH gene variant \n- Negative result for APC gene variants\n- Included in an approved small genetic panel\n\nL is necessary for:\n- Family history of known LS mutation\n- Personal/family history of CRC or endometrial cancer diagnosed before 50\n- Individual with CRC or endometrial cancer suggesting MMR deficiency or Lynch syndrome\n- Personal/family history of LS-related tumors\n- 5% or more risk of having MMR gene mutation \n- Meeting clinical criteria for Lynch syndrome or MLH1 protein not expressed in CRC tumor\n- Included in an approved small genetic panel\n\nS is necessary for:\n- Diagnosis of juvenile polyposis syndrome\n- Relative of individual with juvenile polyposis syndrome\n- Included in an approved small genetic panel\n\nT is necessary for:\n- Diagnosis of Peutz-Jeghers syndrome \n- Relative of individual with Peutz-Jeghers syndrome\n- Included in an approved small genetic panel\n\nP is necessary for:\n- Various criteria for APC, MUTYH, Lynch Syndrome, juvenile polyposis syndrome, Peutz-Jeghers syndrome\n- Personal history of 20 or more adenomas\n- Personal history of 10-20 polyps with specific criteria\n- Family history of known LS mutation\n- Personal/family history of CRC or endometrial cancer diagnosed before 50\n- Personal history of CRC or endometrial cancer with MMR deficiency\n- Personal/family history of LS-related tumors\n- Risk of having MMR gene mutation\n- No CRC diagnosis but family history meeting Amsterdam criteria\n- Included in an approved small genetic panel \n\nTherefore, the algebraic expression for all the requirements to be met would be:\nG ∧ (A ∨ B ∨ C ∨ D) ∧ M ∧ (A ∨ B ∨ C) ∧ L ∧ (A ∨ B ∨ C ∨ D ∨ E ∨ F ∨ G ∨ H ∨ I ∨ J ∨ K ∨ L ∨ M ∨ N ∨ O) ∧ S ∧ (A ∨ B ∨ C) ∧ T ∧ (A ∨ B ∨ C) ∧ P ∧ (A ∨ B ∨ C ∨ D ∨ E ∨ F ∨ G ∨ H ∨ I)",
  "Blue_Shield_of_CA_81406": "Let's define the variables first:\n- A = Known Familial Variant Analysis for Cardiac Disorders\n- B = Targeted Mutation Analysis for a Known Familial Variant\n- C = Comprehensive Cardiomyopathy Panels\n- D = Comprehensive Arrhythmia Panels\n- E = Genomic Unity Cardiac Ion Channelopathies Analysis\n- F = Comprehensive Arrhythmia & Cardiomyopathy Panels\n- G = Hypertrophic Cardiomyopathy Panels\n- H = Dilated Cardiomyopathy Panels\n\nNow we can write the algebraic expression using logical operators:\nRequirement = (A AND B) OR (C) OR (D) OR (E) OR (F) OR (G) OR (H)",
  "Blue_Shield_of_CA_81415": "Let variable A represent the presence of one of the listed genetic testing options for exome sequencing.\nLet variable B represent the presence of one of the listed genetic testing options for genome sequencing.\n\nThe algebraic expression of the requirements for this policy to be applicable using logical operators is:\n\nA OR B",
  "Blue_Shield_of_CA_21085": "Let:\nA = An abnormal structure of the maxilla and mandible caused by accidental injury, congenital defect, developmental abnormality, disease, infection, or trauma\nB = Abnormal function of the maxilla and mandible exclusive of functional abnormalities of the teeth and occlusion\nC = Facial skeletal deformities not correctable with non-surgical modalities\nD = Documentation that orthodontic treatment is completed or not required\nE = Discrepancies in tooth position measurements based on the criteria provided in the policy\n\nThe algebraic expression for the policy to be applicable is:\n(A OR B) AND (C AND D AND E)",
  "Blue_Shield_of_CA_19328": "Let A represent the statement \"Infection is present\"\nLet B represent the statement \"Implant exposure/extrusion through skin is present\"\nLet C represent the statement \"Baker Class IV capsular contracture is present\"\n\nThe algebric expression representing all the requirements for the policy to be applicable would be:\n\n(A OR B OR C)",
  "Blue_Shield_of_CA_11950": "Let's define the following variables:\nP: Procedure is considered reconstructive surgery\nM: Procedure is medically necessary\nA: Procedure will result in minimal improvement in appearance\nD: Sufficient documentation is provided\n\nThe algebraic expression for all the requirements for the policy to be applicable is:\n\n[(P) ∧ ~(M ∧ (A ∨ ~D))] ∨ [(P) ∧ ~(M ∧ (A ∨ ~D))]",
  "Blue_Shield_of_CA_19318": "Let $A$ represent the statement \"surgery performed to correct or repair abnormal structures of the body caused by congenital defects, developmental abnormalities, trauma, infection, tumors, or disease.\"\nLet $B$ represent the statement \"create a normal appearance to the extent possible.\"\nLet $C$ represent the statement \"improve function.\"\n\nThe algebric expression for the requirements for this policy to be applicable using logical operators and variables is:\n$(A \\land (B \\lor C)) \\land (\\lnot((\\lnot B) \\land (\\lnot C)) \\land (\\lnot D))$\n\nWhere $\\lnot$ represents the negation operator and $\\land$ represents the logical AND operator.",
  "Blue_Shield_of_CA_21685": "Let's define the following variables:\n- A: The policy is in effect\n- B: The user meets all eligibility requirements\n- C: The device meets all security standards\n- D: The user accesses the system from an approved location\n\nThe algebric expression of all the requirements for this policy to be applicable using logical operators and variables is:\n\nA = B AND C AND D\n\nThis means that the policy is in effect if and only if the user meets all eligibility requirements (B), the device meets all security standards (C), and the user accesses the system from an approved location (D).",
  "Blue_Shield_of_CA_33927": "Let's define the following variables and logical operators:\n\nVAD = Implantable ventricular assist devices with FDA approval or clearance\nTAH = Total artificial hearts with FDA approved devices\nNYHA = New York Heart Association class\nLV_EF = Left ventricular ejection fraction\nCI = Cardiac index\n\nNow let's write the algebraic expression:\n\n(VAD ∨ TAH) ∧ FDA_approved ∧ (CANDIDATE ∨ EVALUATING) ∧ NOT_SURVIVE\n\nwhere\n∨ is the logical OR operator\n∧ is the logical AND operator\n\nCANDIDATE represents being currently listed as a heart transplantation candidate\nEVALUATING represents undergoing evaluation to determine candidacy for heart transplantation\nNOT_SURVIVE represents not expected to survive until a donor heart can be obtained\n\nThis algebraic expression represents the requirements for the policy to be applicable, where either an Implantable ventricular assist device or a Total artificial heart with FDA approval and meeting candidacy or evaluating criteria while not expected to survive are necessary conditions for the policy statement to be applicable.",
  "Blue_Shield_of_CA_36465": "Let:\nA = Use of surgery (ligation and stripping)\nB = Use of radiofrequency endovenous thermal ablation\nC = Use of laser endovenous thermal ablation\nD = Use of microfoam sclerotherapy\nE = Use of cyanoacrylate adhesion\nF = Demonstrated saphenous reflux and CEAP class C2 or greater\nG = Documentation of ulceration, recurrent thrombophlebitis, hemorrhage, or persistent symptoms\nH = Symptoms significantly interfere with activities of daily living\nI = Conservative management for at least 6 weeks has not improved symptoms\nJ = Treatment meets criteria for being investigational\nK = Combining medically necessary treatments during same treatment session is not medically necessary\nL = Sclerotherapy techniques as primary treatment is investigational\nM = Tributary varicosity treatment may be considered medically necessary\nN = Tributaries are symptomatic\nO = Treatment of varicose tributaries meets criteria for being investigational\nP = Perforator vein treatment meets criteria for being medically necessary\nQ = Presence of leg ulcers that have not resolved following combined treatment for at least 3 months\nR = Venous insufficiency is not secondary to deep venous thromboembolism\nS = Treatment of telangiectasia is investigational\nT = Treatment of telangiectasia less than 3mm in diameter is investigational\nU = Miscellaneous treatments are investigational\nV = Mechanochemical ablation of any vein is investigational\nW = Endovenous cryoablation of any vein is investigational\n\nThe algebraic expression of all the requirements for this policy to be applicable is:\n(F AND (A OR B OR C OR D OR E)) AND (G AND H AND I) AND (NOT J) AND (K) AND (NOT L) AND (M AND N) AND ((O AND P AND Q AND R) OR S OR T) AND (NOT U) AND (V AND W)",
  "Blue_Shield_of_CA_0524T": "Let's represent the requirements for the policy to be applicable using logical operators and variables:\n\nLet:\n- P = Saphenous vein treatment may be considered medically necessary\n- Q = Saphenous vein treatment is investigational\n- R = Combining two treatments is not medically necessary\n- S = Sclerotherapy techniques are investigational\n- T = Tributary varicosity treatment may be considered medically necessary\n- U = Tributary varicosity treatment is investigational\n- V = Perforator vein treatments may be considered medically necessary\n- W = Perforator vein treatments are investigational\n- X = Treatment of telangiectasia is investigational\n\nThe algebraic expression of all the requirements for this policy to be applicable can be represented as:\nP ⇔ (A ∧ B ∧ C) \n∧ (¬Q) \n∧ (¬R) \n∧ (S)\n∧ (T)\n∧ (¬U)\n∧ (V)\n∧ (¬W)\n∧ (¬X)\n\nIn words, this expression means that saphenous vein treatment may be considered medically necessary when all the criteria (A, B, C, etc.) are met, and other conditions related to investigational treatments are not true.",
  "Blue_Shield_of_CA_36466": "Let variables: \nA = Documentation is for using only one of the specified procedures\nB = Demonstrated saphenous reflux and CEAP class C2 or greater\nC = Documentation of ulceration, thrombophlebitis, hemorrhage, or persistent symptoms with interference in daily living \nD = Combination of any two medically necessary treatments not allowed\nE = Sclerotherapy techniques other than microfoam as primary treatment is investigational\nF = Stab avulsion, hook phlebectomy, or transilluminated powered phlebectomy of veins is investigational\nG = Tributary varicosity treatment criteria are met\nH = Treatment of isolated tributary veins without prior or concurrent saphenous veins treatment is investigational\nI = Perforator vein treatment criteria are met\nJ = Treatment of telangiectasia less than 3 millimeters in diameter is investigational\n\nThen, the algebraic expression for all the requirements to be met for this policy to be applicable would be:\n(A AND B AND C AND D AND E AND F AND G AND H AND I AND J)",
  "Blue_Shield_of_CA_36471": "Let:\nA = Documentation to use only one of the following procedures: surgery, radiofrequency endovenous thermal ablation, laser endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesion\nB = Demonstrated saphenous reflux and CEAP class C2 or greater\nC = Documentation of ulceration, recurrent thrombophlebitis, hemorrhage, persistent symptoms interfering with daily activities, and failed conservative management\nD = Treatment of saphenous veins by surgery, endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesive not meeting criteria is investigational\nE = Combining two medically necessary treatments during the same session is not medically necessary\nF = Sclerotherapy techniques (other than microfoam) as primary treatment of saphenous veins are investigational\nG = Stab avulsion, hook phlebectomy, or transilluminated powered phlebectomy of veins is investigational\nH = Tributary varicosity treatment meeting specific criteria may be considered medically necessary\nI = Treatment of tributaries separately from saphenous vein treatment using microfoam or cyanoacrylate is investigational\nJ = Treatments of isolated tributary veins, isolated varicose tributaries using different techniques, or endovenous radiofrequency/laser ablation of tributary veins are investigational\nK = Perforator vein treatments for leg ulcers may be considered medically necessary under specific conditions\nL = Stab avulsion, hook phlebectomy, or transilluminated powered phlebectomy of perforator veins is investigational\nM = Treatment of telangiectasia less than 3 millimeters in diameter is investigational\nN = Mechanochemical ablation or endovenous cryoablation of any vein is investigational\n\nThe algebraic expression for all the requirements for this policy to be applicable would be:\n(A ∧ B ∧ C) ∨ (D ∧ E) ∨ (F) ∨ (G) ∨ (H ∧ I) ∨ (J) ∨ (K) ∨ (L) ∨ (M) ∨ (N)",
  "Blue_Shield_of_CA_36470": "Let the variables be:\n- P: Documentation to use only one of the specified procedures\n- Q: Demonstrated saphenous reflux and CEAP class C2 or greater\n- R: Documentation of ulceration, thrombophlebitis, hemorrhage, or persistent symptoms\n- S: Symptoms significantly interfere with activities of daily living\n- T: Conservative management for at least 6 weeks has not improved symptoms\n- U: Treatment of saphenous veins by specified procedures that do not meet criteria is investigational\n- V: Combining two medically necessary treatments during the same session is not medically necessary\n- W: Sclerotherapy techniques as primary treatment of veins is investigational\n- X: Stab avulsion, hook phlebectomy, or transilluminated powered phlebectomy is investigational\n- Y: Tributary varicosity treatment is medically necessary if specific criteria are met\n- Z: Use of microfoam or cyanoacrylate when using leftover product during the same session\n- A: Treatment of isolated tributary veins without treatment of saphenous veins is investigational\n- B: Isolated treatment of symptomatic varicose tributaries using other techniques is investigational\n- C: Endovenous radiofrequency or laser ablation of tributary veins is investigational\n- D: Perforator vein treatments for leg ulcers is medically necessary if specific criteria are met\n- E: Stab avulsion, hook phlebectomy, transilluminated powered phlebectomy of perforator veins are investigational\n- F: Treatment of telangiectasia less than 3mm in diameter is investigational\n- G: Mechanochemical ablation of any vein is investigational\n- H: Endovenous cryoablation of any vein is investigational\n\nThe algebraic expression for all the requirements for this policy to be applicable using logical operators would be: \n\n(P ∧ Q ∧ R ∧ (S ∧ T) ∧ U) ∨ (V) ∨ (W) ∨ (X) ∨ (Y ∧ Z) ∨ (A) ∨ (B) ∨ (C) ∨ (D) ∨ (E) ∨ (F) ∨ (G) ∨ (H)",
  "Blue_Shield_of_CA_36475": "Let variables:\n- P: Saphenous vein treatment is medically necessary\n- A: Use of one of the specified procedures\n- B: Demonstrated saphenous reflux and CEAP class C2 or greater\n- C: Documentation of specific symptoms associated with saphenous reflux\n- D: Treatment of saphenous veins not meeting criteria is investigational\n- E: Combining two treatments during the same session is not medically necessary\n- F: Sclerotherapy techniques other than microfoam sclerotherapy as primary treatment are investigational\n- G: Certain surgical procedures for tributary varicosity treatment are medically necessary\n- H: Successful previous treatment of saphenous veins or treatment in the same session for tributary varicosity\n- I: Tributaries are symptomatic\n- J: Treatment of isolated tributary veins without prior or concurrent saphenous vein treatment is investigational\n- K: Perforator vein treatment for leg ulcers using specified procedures is medically necessary\n- L: Demonstration of perforator reflux for medical necessity of treatment\n- M: Presence of ulcers that have not resolved following previous treatments for at least 3 months\n- N: Venous insufficiency is not secondary to deep venous thromboembolism\n- O: Treatment of telangiectasia less than 3mm in diameter is investigational\n- P: Mechanochemical ablation of any vein is investigational\n- Q: Endovenous cryoablation of any vein is investigational\n\nThe algebraic expression for the criteria for the policy to be applicable is:\n\nP ⇔ (A ∧ B ∧ C) ∧ D ∧ E ∧ F ∧ (G ∧ H ∧ I) ∧ J ∧ K ∧ (L ∧ M ∧ N) ∧ O ∧ (P ∧ Q)",
  "Blue_Shield_of_CA_36468": "Let:\nP = Saphenous vein treatment may be considered medically necessary\nQ = Treatment of saphenous veins by surgery, endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesive is investigational\nR = Combining the use of any two medically necessary treatments during the same treatment session on the same vein or same type of vein is not medically necessary\nS = Sclerotherapy techniques as the primary treatment of great, small, or accessory saphenous veins, is investigational\nT = Stab avulsion, hook phlebectomy, or transilluminated powered phlebectomy of perforator, great, small, or accessory saphenous veins are investigational\nU = Tributary varicosity treatment may be considered medically necessary\nV = Treatment of varicose tributaries using microfoam sclerotherapy or cyanoacrylate during the same session as saphenous vein treatments using the same agent is not medically necessary\nW = Treatment of varicose tributaries using microfoam sclerotherapy or cyanoacrylate when done separately from saphenous vein treatment is investigational\nX = Treatment of isolated tributary veins without prior or concurrent treatment of saphenous veins is investigational\nY = Treatment of isolated symptomatic varicose tributaries using any other techniques is investigational\nZ = Endovenous radiofrequency or laser ablation of tributary veins is investigational\nA = Perforator vein treatments for leg ulcers may be considered medically necessary\nB = Stab avulsion, hook phlebectomy, transilluminated powered phlebectomy of perforator veins is investigational\nC = Treatment of telangiectasia that are less than 3 millimeters in diameter is investigational\nD = Mechanochemical ablation (MOCA) of any vein is investigational\nE = Endovenous cryoablation of any vein is investigational\n\nThe algebric expression of all the requirement for this policy to be applicable using logical operators and variables is:\nP ⇔ (A ∧ B ∧ C) ∧ (Q ∨ R ∨ S ∨ T ∨ U ∨ V ∨ W ∨ X ∨ Y ∨ Z ∨ A ∨ B ∨ C ∨ D ∨ E)",
  "Blue_Shield_of_CA_36473": "Let the following variables be defined:\n- A: Documentation to use only one of the following procedures (not combined use of different procedures or an unlisted procedure): surgery (ligation and stripping), radiofrequency endovenous thermal ablation, laser endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesion\n- B: There is demonstrated saphenous reflux and CEAP class C2 or greater\n- C: Documentation of ulceration secondary to venous stasis, recurrent superficial thrombophlebitis, hemorrhage or recurrent bleeding episodes from a ruptured superficial varicosity, persistent pain, swelling, itching, burning, or other symptoms associated with saphenous reflux, and both of the following:\n  - a: The symptoms significantly interfere with activities of daily living\n  - b: Conservative management including compression therapy for at least 6 weeks has not improved the symptoms\n- D: Treatment of saphenous veins by surgery, endovenous thermal ablation (radiofrequency or laser), microfoam sclerotherapy, or cyanoacrylate adhesive that does not meet the criteria described is considered investigational\n- E: Combining the use of any two medically necessary treatments during the same treatment session on the same vein or same type of vein is considered not medically necessary\n- F: Sclerotherapy techniques (other than microfoam sclerotherapy) as the primary treatment of great, small, or accessory saphenous veins is considered investigational\n- G: Stab avulsion, hook phlebectomy, or transilluminated powered phlebectomy of perforator, great, small, or accessory saphenous veins are considered investigational\n- H: Tributary varicosity treatment when performed either at the same time (or following prior treatment) as saphenous vein treatment may be considered medically necessary when all criteria have been met\n\nAn algebraic expression for the requirements in the policy statement using logical operators and variables:\nA AND B AND C AND D AND E AND F AND G AND H",
  "Blue_Shield_of_CA_36474": "Let:\nA = Documentation to use only one of the following procedures (not combined use of different procedures or an unlisted procedure): surgery (ligation and stripping), radiofrequency endovenous thermal ablation, laser endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesion\nB = There is demonstrated saphenous reflux and CEAP class C2 or greater\nC = There is documentation of one or more of the following: \n1. Ulceration secondary to venous stasis\n2. Recurrent superficial thrombophlebitis\n3. Hemorrhage or recurrent bleeding episodes from a ruptured superficial varicosity\n4. Persistent pain, swelling, itching, burning, or other symptoms are associated with saphenous reflux, and both of the following:\n   a. The symptoms significantly interfere with activities of daily living\n   b. Conservative management including compression therapy for at least 6 weeks has not improved the symptoms\n\nThen, the algebraic expression of all the requirements for this policy to be applicable using logical operators and variables would be:\n\n(A AND B AND C) OR [(A AND B AND C) AND (A AND B AND C)] OR [(A AND B AND C) AND (A AND B AND C) AND (A AND B AND C)] OR ... (repeating the pattern for each criteria)",
  "Blue_Shield_of_CA_36476": "Let's define the following variables:\n- A: Procedure used (1 if surgery, 2 if radiofrequency endovenous thermal ablation, 3 if laser endovenous thermal ablation, 4 if microfoam sclerotherapy, 5 if cyanoacrylate adhesion)\n- B: Saphenous reflux present (1 if yes, 0 if no)\n- C: CEAP class C2 or greater (1 if yes, 0 if no)\n- D: Ulceration present (1 if yes, 0 if no)\n- E: Recurrent superficial thrombophlebitis present (1 if yes, 0 if no)\n- F: Hemorrhage or recurrent bleeding episodes present (1 if yes, 0 if no)\n- G: Symptoms present (1 if yes, 0 if no)\n- H: Symptoms significantly interfere with activities of daily living (1 if yes, 0 if no)\n- I: Conservative management for at least 6 weeks not effective (1 if yes, 0 if no)\n\nThe algebraic expression for all the requirements for this policy to be applicable is:\n(A=1 OR A=2 OR A=3 OR A=4 OR A=5) AND (B=1 AND C=1) AND ((D=1) OR (E=1) OR (F=1) OR ((G=1) AND (H=1) AND (I=1)))\n\nThis expression represents the logical operators and variables needed to meet all the criteria for saphenous vein treatment to be considered medically necessary according to the policy statement.",
  "Blue_Shield_of_CA_36478": "Let the variables be:\nS - Saphenous vein treatment\na - Surgery (ligation and stripping)\nr - Radiofrequency endovenous thermal ablation\nl - Laser endovenous thermal ablation\nm - Microfoam sclerotherapy\nca - Cyanoacrylate adhesion\nsx - Demonstrated saphenous reflux and CEAP class C2 or greater\nu - Ulceration secondary to venous stasis\nst - Recurrent superficial thrombophlebitis\nhb - Hemorrhage or recurrent bleeding episodes from a ruptured superficial varicosity\ns - Persistent pain, swelling, itching, burning, or other symptoms\nadl - Symptoms significantly interfere with activities of daily living\ncm - Conservative management including compression therapy for at least 6 weeks\nism - Investigational saphenous vein treatment\nnmn - Not medically necessary\nsst - Combining the use of any two medically necessary treatments during the same treatment session on the same vein or same type of vein\nism - Investigational Sclerotherapy techniques as the primary treatment of great, small, or accessory saphenous veins\nms - Standard foam sclerotherapy\ntas - Stab avulsion, hook phlebectomy, or transilluminated powered phlebectomy\nvt - Symptomatic Varicose Tributaries\na - Tributary varicosity treatment\nvtm - Isolated treatment of symptomatic varicose tributaries\npv - Perforator Veins\nlv - Leg ulcers\nvg - Great saphenous veins\nvp - Perforator vein treatments\numu - Microfoam sclerotherapy or cyanoacrylate only when using leftover product during the same session as saphenous vein treatments using the same agent\ni - Investigational\ntw - Microfoam sclerotherapy does not apply to standard foam sclerotherapy\nils - Isolated treatment of symptomatic varicose tributaries\non - Treatment of telangiectasia such as spider veins, angiomata, and hemangiomata that are less than 3 millimeters in diameter\nim - Investigational Mechanochemical ablation of any vein\nec - Endovenous cryoablation of any vein\n\nThe algebraic expression for all the requirements for this policy to be applicable using logical operators and variables would be:\n\n(S ^ (a v r v l v m v ca) ^ sx ^ (u v st v hb v (s ^ adl ^ ~cm)) ^ (~ism)) v ((ism v nmn) ^ ~sst) ^ (~ism v ms) ^ ((tas ^ a ^ vtm) ^ vg ^ uv ^ cm) v (((umu ^ s) ^ cm) v (tw ^ ~ms)) ^ ((vt v vtm v tas) ^ vt ^ tas) ^ ((pv ^ lv) ^ (vg v vp) ^ (u ^ ~cm) ^ ~dvt) ^ ((pv ^ tas) ^ i)\n",
  "Blue_Shield_of_CA_36479": "Let:\nA: Documentation for specific procedure\nB: Demonstrated saphenous reflux and CEAP class C2 or greater\nC: Documentation of specific symptoms and failed conservative management\nD: Treatment of saphenous veins using approved procedures\nE: Combined use of multiple treatments on same vein is not medically necessary\nF: Treatment of tributary varicosities\nG: Successful or concurrent treatment of saphenous veins\nH: Use of microfoam sclerotherapy or cyanoacrylate\nI: Investigational treatments for isolated tributary veins\nJ: Perforator vein treatments for leg ulcers\nK: Treatment of telangiectasia less than 3mm in diameter\nL: Investigational treatments for certain vein ablation techniques\n\nThe expression for all requirements to be met:\n(A & B & C & D & E) | (F & G & H) | (J & H) | (K) | (L)",
  "Blue_Shield_of_CA_36482": "Let:\nA = Documentation to use only one of the specified procedures (surgery, radiofrequency endovenous thermal ablation, laser endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesion)\nB = Demonstrated saphenous reflux and CEAP class C2 or greater\nC = Documentation of ulceration, recurrent superficial thrombophlebitis, hemorrhage, persistent symptoms interfering with daily activities, symptoms not improved with conservative management\nD = Treatment of saphenous veins by surgery, endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesive that meets the criteria\nE = Combining two medically necessary treatments during the same treatment session not allowed\nF = Sclerotherapy techniques other than microfoam sclerotherapy as the primary treatment of saphenous veins is investigational\nG = Stab avulsion, hook phlebectomy, or transilluminated powered phlebectomy of veins considered investigational\nH = Tributary varicosity treatment meeting certain criteria\nI = Microfoam sclerotherapy or cyanoacrylate only used with leftover product during the same session as saphenous vein treatments\nJ = Investigational use of microfoam sclerotherapy or cyanoacrylate when done separately from saphenous vein treatment\nK = Investigational treatments for isolated tributary veins without prior or concurrent treatment of saphenous veins\nL = Investigational treatments for perforator veins\nM = Investigational treatment of telangiectasia\nN = Investigational treatments including Mechanochemical ablation (MOCA) and Endovenous cryoablation of any vein\n\nThe expression for all requirements to be met for this policy to be applicable would be:\n(A AND B AND (C1 OR C2 OR C3 OR C4 AND (C1a AND C1b)) AND D AND NOT E AND F AND G AND H AND I AND (J1 OR J2) AND K AND L AND M AND N)",
  "Blue_Shield_of_CA_36483": "Let A be the variable representing the documentation to use only one of the specified procedures,\nLet B be the variable representing demonstrated saphenous reflux and CEAP class C2 or greater,\nLet C be the variable representing documentation of ulceration, thrombophlebitis, hemorrhage, or persistent symptoms,\nLet D be the variable representing symptoms significantly interfering with activities of daily living and lack of improvement with conservative management,\nLet E be the variable representing treatment of saphenous veins by surgery, endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesive that meets the criteria,\nLet F be the variable representing combining two medically necessary treatments during the same session,\nLet G be the variable representing sclerotherapy techniques as primary treatment of saphenous veins,\nLet H be the variable representing tributary varicosity treatment meeting criteria when performed with saphenous vein treatment,\nLet I be the variable representing treatment of symptomatic varicose tributaries with microfoam sclerotherapy or cyanoacrylate,\nLet J be the variable representing treatment of tributary veins without concurrent treatment of saphenous veins,\nLet K be the variable representing perforator vein treatment for leg ulcers meeting specified conditions,\nLet L be the variable representing treatment of telangiectasia less than 3mm in diameter being investigational,\nLet M be the variable representing mechanochemical ablation (MOCA) of any vein being investigational,\nLet N be the variable representing endovenous cryoablation of any vein being investigational.\n\nThe algebraic expression representing all the requirements for the policy to be applicable using logical operators would be:\n(A AND B AND C AND D) OR (E AND NOT F) OR (G AND NOT H) OR (I AND NOT J) OR (K) OR (L) OR (M AND N)",
  "Blue_Shield_of_CA_37500": "Let's define the following variables:\n- A: Documentation to use only one of the specified procedures\n- B: Demonstrated saphenous reflux and CEAP class C2 or greater\n- C: Documentation of ulceration, thrombophlebitis, hemorrhage, or persistent symptoms with interference with daily activities and failed conservative management\n- D: Treatment of saphenous veins using specified procedures that meet the criteria described above\n- E: Investigational treatment of saphenous veins\n- F: Non-medically necessary combination of treatments for saphenous veins\n- G: Investigational use of sclerotherapy techniques as primary treatment\n- H: Investigational treatment of tributary veins\n- I: Medically necessary treatment of symptomatic varicose tributaries\n- J: Investigational treatment of isolated tributaries or endovenous radiofrequency/laser ablation of tributary veins\n- K: Medically necessary treatment of perforator veins for leg ulcers\n- L: Investigational treatment of perforator veins using certain techniques\n- M: Investigational treatment of telangiectasia\n- N: Investigational treatment using MOCA or endovenous cryoablation\n\nWith these variables, we can construct the algebraic expression representing the requirements for the policy to be applicable:\n\n(A AND B AND C AND D) OR (E AND NOT F) OR G OR H OR (I AND NOT J) OR (K AND NOT L) OR M OR N",
  "Blue_Shield_of_CA_37700": "Let:\nA = Documentation to use only one of the following procedures: surgery (ligation and stripping), radiofrequency endovenous thermal ablation, laser endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesion\nB = Demonstrated saphenous reflux and CEAP class C2 or greater\nC1 = Ulceration secondary to venous stasis\nC2 = Recurrent superficial thrombophlebitis\nC3 = Hemorrhage or recurrent bleeding episodes from a ruptured superficial varicosity\nC4 = Persistent pain, swelling, itching, burning, or other symptoms associated with saphenous reflux that significantly interfere with activities of daily living and have not improved after conservative management including compression therapy for at least 6 weeks\nD = Treatment of saphenous veins by surgery, endovenous thermal ablation (radiofrequency or laser), microfoam sclerotherapy, or cyanoacrylate adhesive meets criteria\nE = Use of any two medically necessary treatments during the same session on the same vein or same type of vein is not medically necessary\nF = Sclerotherapy techniques (other than microfoam sclerotherapy) as the primary treatment of great, small, or accessory saphenous veins is investigational\nG = Stab avulsion, hook phlebectomy, or transilluminated powered phlebectomy of perforator, great, small, or accessory saphenous veins is investigational\nH = Treatment of tributary varicosities at the same time as saphenous vein treatment meets criteria\nI = Treatment of isolated tributary veins without prior or concurrent treatment of saphenous veins is investigational\nJ = Treatment of telangiectasia less than 3mm in diameter is investigational\nK = Mechanochemical ablation (MOCA) of any vein is investigational\nL = Endovenous cryoablation of any vein is investigational\n\nTherefore, the algebraic expression of all the requirements for this policy to be applicable is:\n(A AND B AND (C1 OR C2 OR C3 OR C4) AND D AND E AND F AND G AND H AND I AND J AND K AND L)",
  "Blue_Shield_of_CA_37718": "Let's denote the following variables:\n\nS = Saphenous vein treatment\nP = Procedure used (surgery, radiofrequency ablation, laser ablation, microfoam sclerotherapy, cyanoacrylate adhesion)\nR = Saphenous reflux and CEAP class C2 or greater\nD = Documentation of specified symptoms (ulceration, thrombophlebitis, hemorrhage, pain, swelling, itching, burning)\nI = Symptoms significantly interfere with daily activities\nM = Conservative management for at least 6 weeks has not improved symptoms\nT = Treatment of saphenous veins (surgery, thermal ablation, microfoam sclerotherapy, cyanoacrylate adhesive)\nC = Combination of two medically necessary treatments during the same session\nSCL = Sclerotherapy techniques as primary treatment\nTR = Tributary varicosity treatment\nPVT = Perforator vein treatments\nTEL = Treatment of telangiectasia\nMISC = Miscellaneous treatments (MOCA, cryoablation)\n\nWith these variables, the algebraic expression for all the requirements for this policy to be applicable is as follows:\nS ∧ (P = surgery ∨ P = radiofrequency ablation ∨ P = laser ablation ∨ P = microfoam sclerotherapy ∨ P = cyanoacrylate adhesion) ∧ R ∧ (D ∨ (I ∧ M)) ∧ (T ∧ ¬C) ∧ ¬(SCL) ∧ TR ∧ (P = stab avulsion ∨ P = hook phlebectomy ∨ P = standard sclerotherapy ∨ P = transilluminated powered phlebectomy) ∧ S → TR ∧ R ∧ ¬(C ∨ P = microfoam sclerotherapy ∨ P = cyanoacrylate adhesive) ∧ ¬(PVT ∨ P = microfoam sclerotherapy ∨ P = cyanoacrylate adhesive) ∧ PVT ∧ (P = surgery ∨ P = radiofrequency ablation ∨ P = laser ablation ∨ P = microfoam sclerotherapy ∨ P = cyanoacrylate adhesion) ∧ R ∧ ¬(D ∨ C ∨ P) ∧ ¬(P = stab avulsion ∨ P = hook phlebectomy ∨ P = transilluminated powered phlebectomy) ∧ ¬(TEL) ∧ ¬(MISC) \n\nThis expression encapsulates the logical conditions and requirements set forth in the policy statement for the applicability of various treatments.",
  "Blue_Shield_of_CA_37722": "Let:\nP = Saphenous vein treatment\nQ = Criteria met: documentation to use only one specific procedure, demonstrated saphenous reflux and CEAP class C2 or greater, and documentation of specific symptoms\nR = Treatment of saphenous veins by surgery, endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesive is investigational\nS = Combining two medically necessary treatments in the same session is not medically necessary\nT = Sclerotherapy techniques as the primary treatment of great, small, or accessory saphenous veins is investigational\nU = Certain varicosity treatments are investigational\nV = Tributary varicosity treatment is medically necessary in specific circumstances\nW = Use of microfoam or cyanoacrylate only when leftover product is being used \nX = Use of microfoam or cyanoacrylate for symptomatic varicose tributaries is investigational if done separately from saphenous vein treatment\nY = Certain treatment of isolated tributary veins is investigational\nZ = Treatment of perforator veins is medically necessary in specific circumstances\nA = Certain treatments of perforator veins are investigational\nB = Treatment of telangiectasia is investigational if less than 3 millimeters in diameter\nC = Certain treatments of veins are investigational\n\nThe algebraic expression for all the requirements in the policy to be applicable would be:\n\nP ∧ (Q ∧ ¬R ∧ S ∧ T ∧ U ∧ V ∧ W ∧ X ∧ Y ∧ Z ∧ A ∧ B ∧ C)",
  "Blue_Shield_of_CA_37735": "Let's define the following variables:\n\nA: Documentation to use only one of the following procedures: surgery (ligation and stripping), radiofrequency endovenous thermal ablation, laser endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesion\nB: There is demonstrated saphenous reflux and CEAP class C2 or greater\nC: Documentation of ulceration, recurrent superficial thrombophlebitis, hemorrhage or recurrent bleeding episodes, persistent symptoms associated with saphenous reflux, and failed conservative management\nD: Treatment of saphenous veins by surgery, endovenous thermal ablation, microfoam sclerotherapy or cyanoacrylate adhesive that does not meet criteria is investigational\nE: Combining the use of any two medically necessary treatments during the same session is not medically necessary\nF: Sclerotherapy techniques as the primary treatment of saphenous veins, other than microfoam sclerotherapy, is investigational\nG: Stab avulsion, hook phlebectomy, or transilluminated powered phlebectomy of veins are investigational\nH: Tributary varicosity treatment may be considered medically necessary when met criteria\nI: Treatment of tributaries using specific procedures is investigational when done separately from saphenous vein treatment\nJ: Treatment of isolated tributary veins, isolated treatment of symptomatic varicose tributaries using other techniques, and endovenous radiofrequency or laser ablation of tributary veins are investigational\nK: Perforator vein treatments for leg ulcers may be considered medically necessary when met conditions\nL: Stab avulsion, hook phlebectomy, transilluminated powered phlebectomy of perforator veins are investigational\nM: Treatment of telangiectasia less than 3 millimeters in diameter is investigational\nN: Mechanochemical ablation (MOCA) of any vein is investigational\nO: Endovenous cryoablation of any vein is investigational\n\nNow, we can express the requirements for the policy to be applicable using logical operators and the variables defined above:\n\n(A and B and C) or (D and E) or (F) or (G) or (H and I) or (J) or (K) or (L) or (M) or (N) or (O)",
  "Blue_Shield_of_CA_37760": "Let's define the following variables:\nA = Documentation to use only one of the following procedures (not combined use of different procedures or an unlisted procedure)\nB = There is demonstrated saphenous reflux and CEAP class C2 or greater\nC = There is documentation of one or more of the following: ulceration, recurrent superficial thrombophlebitis, hemorrhage or recurrent bleeding episodes, persistent symptoms, interference with daily activities, and non-improvement with conservative management\nD = Treatment of saphenous veins by surgery, endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesive meets criteria\nE = Combining the use of any two medically necessary treatments during the same treatment session on the same vein or same type of vein is not medically necessary\nF = Sclerotherapy techniques (other than microfoam sclerotherapy) as the primary treatment of saphenous veins is investigational\nG = Stab avulsion, hook phlebectomy, or transilluminated powered phlebectomy of perforator veins is investigational\nH = Tributary varicosity treatment is medically necessary when specific criteria are met\nI = Treatment of varicose tributaries with microfoam sclerotherapy or cyanoacrylate during the same session as saphenous vein treatments using the same agent is allowed\nJ = Treatment of varicose tributaries with microfoam sclerotherapy or cyanoacrylate separately from saphenous vein treatment is investigational\nK = Treatment of isolated tributary veins without prior or concurrent treatment of saphenous veins is investigational\nL = Treatment of perforator veins for leg ulcers is medically necessary when specific criteria are met\nM = Stab avulsion, hook phlebectomy, transilluminated powered phlebectomy of perforator veins is investigational\nN = Treatment of telangiectasia that are less than 3 millimeters in diameter is investigational\nO = Mechanochemical ablation (MOCA) of any vein is investigational\nP = Endovenous cryoablation of any vein is investigational\n\nThe algebraic expression of all requirements for the policy to be applicable is as follows:\nA AND B AND C AND D AND E AND F AND G AND H AND I AND J AND K AND L AND M AND N AND O AND P",
  "Blue_Shield_of_CA_37765": "Let:\nP = Saphenous vein treatment considered medically necessary\nQ = Treatment includes one of the specified procedures\nR = Demonstrated saphenous reflux and CEAP class C2 or greater\nS = Documentation of specific symptoms\nT = Symptoms significantly interfere with activities of daily living\nU = Conservative management for at least 6 weeks has not improved symptoms\n\nThe algebric expression for the policy to be applicable is:\nP = Q ∧ R ∧ (S ∨ (T ∧ U))",
  "Blue_Shield_of_CA_37766": "Let the variables be:\nSurgery (S), Radiofrequency Endovenous Thermal Ablation (RFA), Laser Endovenous Thermal Ablation (LETA), Microfoam Sclerotherapy (MS), Cyanoacrylate Adhesion (CA)\nSaphenous Reflux (SR)\nCEAP class C2 or greater (CEAP)\nUlceration (UL), Recurrent Superficial Thrombophlebitis (RST), Hemorrhage (H), Recurrent Bleeding Episodes (RBE), Persistent Symptoms (PS), Symptoms Interfere (SI), Conservative Management (CM)\nInvestigational (I)\nTreatment session (TS)\nTributary Varicosity Treatment (TVT)\nPerforator Reflux (PR)\nLeg Ulcers (LU)\nTelangiectasia (T)\n\nThe algebraic expression of all the requirements for the policy to be applicable can be written as:\n(S ∨ RFA ∨ LETA ∨ MS ∨ CA) ∧ (SR ∧ CEAP) ∧ [(UL ∨ RST ∨ H ∨ RBE ∨ PS) ∧ (SI ∧ ¬CM)] ∧ ¬I ∧ ¬((TS ∧ SR) ∧ (TS ∧ SR)) ∧ (MS ∨ ¬TVT) ∧ (PR ∧ ¬LU ∧ (LU ∧ ¬CM) ∧ ¬DVT) ∧ ¬(I) ∧ ¬(T)",
  "Blue_Shield_of_CA_37780": "Let's denote the variables as follows:\n- A: Documentation to use only one of the specified procedures\n- B: Demonstrated saphenous reflux and CEAP class C2 or greater\n- C: Documentation of specified symptoms and interference with daily activities\n- D: Conservative management including compression therapy for at least 6 weeks has not improved symptoms\n- E: Treatment of saphenous veins by surgery, endovenous thermal ablation, microfoam sclerotherapy or cyanoacrylate adhesive is investigational\n- F: Combining the use of any two medically necessary treatments during the same treatment session on the same vein or same type of vein is not medically necessary\n- G: Sclerotherapy techniques (other than microfoam sclerotherapy) as the primary treatment of saphenous veins is investigational\n- H: Tributary varicosity treatment criteria have been met\n- I: Tributaries are symptomatic\n- J: Use of microfoam sclerotherapy or cyanoacrylate only when using leftover product during the same session as saphenous vein treatments using the same agent\n- K: Treatment of isolated tributary veins without prior or concurrent treatment of saphenous veins is investigational\n- L: Perforator vein treatment criteria have been met\n- M: Presence of ulcers that have not resolved following combined superficial vein treatment and compression therapy for at least 3 months\n- N: Venous insufficiency is not secondary to deep venous thromboembolism\n- O: Treatment of telangiectasia less than 3 millimeters in diameter is investigational\n- P: Mechanochemical ablation (MOCA) of any vein is investigational\n- Q: Endovenous cryoablation of any vein is investigational\n\nThe algebraic expression for all the requirements to apply the policy statement can be written as:\n\n(A AND B AND (C AND D) AND NOT E AND NOT F AND NOT G) OR \n(H AND I AND J AND NOT K AND (L AND M AND N) AND NOT O AND NOT P AND NOT Q)",
  "Blue_Shield_of_CA_37785": "Let \nS = surgery (ligation and stripping) \nR = radiofrequency endovenous thermal ablation \nL = laser endovenous thermal ablation \nM = microfoam sclerotherapy \nC = cyanoacrylate adhesion \ncriteria = S OR R OR L OR M OR C \nCEAP = Clinical, Etiology, Anatomy, Pathophysiology \nulceration = Ulceration secondary to venous stasis \nthrombophlebitis = Recurrent superficial thrombophlebitis \nhemorrhage = Hemorrhage or recurrent bleeding episodes from a ruptured superficial varicosity \nsymptoms = Persistent pain, swelling, itching, burning, or other symptoms are associated with saphenous reflux \ninterfere = The symptoms significantly interfere with activities of daily living \nmanagement = Conservative management including compression therapy for at least 6 weeks has not improved the symptoms \n\nexpression = (criteria AND saphenous reflux AND CEAP C2 or greater AND (ulceration OR thrombophlebitis OR hemorrhage OR (symptoms AND interfere AND management))) OR investigational \nAND NOT (combining treatments OR sclerotherapy techniques OR tributary treatments OR isolating tributary treatments OR radiofrequency or laser ablation of tributary veins OR perforator vein treatments OR Stab avulsion, hook phlebectomy, transilluminated powered phlebectomy of perforator veins OR telangiectasia treatments OR mechanochemical ablation OR endovenous cryoablation)",
  "Blue_Shield_of_CA_37799": "Let:\nA = Documentation to use only one of the specified procedures\nB = Demonstrated saphenous reflux and CEAP class C2 or greater\nC = Documentation of specific symptoms and interference with daily living, as well as failed conservative management\nD = Treatment of saphenous veins by specified procedures that meet the criteria\nE = Combining medically necessary treatments is not necessary\nF = Sclerotherapy techniques other than microfoam are investigational\nG = Various specific treatments for varicose tributaries are necessary\nH = Use of microfoam or cyanoacrylate only when using leftover product during the same session\n\nThen, the algebraic expression would be:\nPolicy = A ∧ B ∧ C ∧ D ∧ E ∧ F ∧ G ∧ H",
  "Blue_Shield_of_CA_76942": "Let A = documentation to use only one of the following procedures (not combined use of different procedures or an unlisted procedure): surgery (ligation and stripping), radiofrequency endovenous thermal ablation, laser endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesion \nLet B = demonstrated saphenous reflux and CEAP class C2 or greater \nLet C = documentation of one or more of the following: 1. Ulceration secondary to venous stasis 2. Recurrent superficial thrombophlebitis 3. Hemorrhage or recurrent bleeding episodes from a ruptured superficial varicosity 4. Persistent pain, swelling, itching, burning, or other symptoms are associated with saphenous reflux, and both of the following: a. The symptoms significantly interfere with activities of daily living b. Conservative management including compression therapy for at least 6 weeks has not improved the symptoms\n\nThe algebraic expression would be: A ∧ B ∧ C.",
  "Blue_Shield_of_CA_93970": "Let:\nA = use of surgery (ligation and stripping)\nB = use of radiofrequency endovenous thermal ablation\nC = use of laser endovenous thermal ablation\nD = use of microfoam sclerotherapy\nE = use of cyanoacrylate adhesion\nF = demonstrated saphenous reflux and CEAP class C2 or greater\nG = ulceration secondary to venous stasis\nH = recurrent superficial thrombophlebitis\nI = hemorrhage or recurrent bleeding episodes from a ruptured superficial varicosity\nJ = persistent symptoms associated with saphenous reflux interfere with daily living\nK = conservative management including compression therapy for at least 6 weeks has not improved symptoms\n\nThe algebraic expression for all the requirements for the policy to be applicable using logical operators and variables would be:\n\n(A ∨ B ∨ C ∨ D ∨ E) ∧ (F ∧ (G ∨ H ∨ I ∨ (J ∧ K))) ∧ ¬(A ∧ B) ∧ ¬(A ∧ C) ∧ ¬(A ∧ D) ∧ ¬(A ∧ E) ∧ ¬(B ∧ C) ∧ ¬(B ∧ D) ∧ ¬(B ∧ E) ∧ ¬(C ∧ D) ∧ ¬(C ∧ E) ∧ ¬(D ∧ E)",
  "Blue_Shield_of_CA_93971": "Let:\nA = Use only one of the following procedures: surgery (ligation and stripping), radiofrequency endovenous thermal ablation, laser endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesion\nB = Demonstrated saphenous reflux and CEAP class C2 or greater\nC = Documentation of ulceration, recurrent superficial thrombophlebitis, hemorrhage or recurrent bleeding episodes, or persistent symptoms associated with saphenous reflux that significantly interfere with activities of daily living and have not improved with conservative management\nD = Treatment of saphenous veins by surgery, endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesive that meets the criteria described above\nE = Combining the use of any two medically necessary treatments during the same treatment session on the same vein or same type of vein\nF = Sclerotherapy techniques (other than microfoam sclerotherapy) as the primary treatment of great, small, or accessory saphenous veins\nG = Standard foam sclerotherapy used for cleanup of small sections of saphenous veins after primary treatment by surgery, endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesive\nH = Investigational treatment of stab avulsion, hook phlebectomy, or transilluminated powered phlebectomy of perforator, great, small, or accessory saphenous veins\nI = Tributary varicosity treatment when performed at the same time or following prior treatment as saphenous vein treatment\nJ = Treatment of isolated tributary veins without prior or concurrent treatment of saphenous veins\nK = Endovenous radiofrequency or laser ablation of tributary veins\nL = Perforator vein treatments for leg ulcers using surgical ligation, endovenous thermal ablation, microfoam or standard foam sclerotherapy, or cyanoacrylate adhesion\nM = Treatment of telangiectasia less than 3 millimeters in diameter\nN = Investigational treatment of mechanochemical ablation (MOCA) of any vein\nO = Investigational treatment of endovenous cryoablation of any vein\n\nThe algebraic expression would be:\n(A) AND (B) AND (C) AND (D) AND (NOT(E)) AND (NOT(F)) AND (G) AND (NOT(H)) AND (I) AND (NOT(J)) AND (NOT(K)) AND (L) AND (M) AND (NOT(N)) AND (NOT(O))"
}
