{
  "Blue_Shield_of_CA_00170": "Let:\nA = Dental general anesthesia is performed in a hospital, outpatient surgery center, or a dental office which has met the requirements established by the Dental Board of California for the provision of general anesthesia\nB = The dental procedure generally does not ordinarily require general anesthesia\nC = The patient is less than seven years of age\nD = The patient is developmentally disabled\nE = The patient's health is compromised\n\nThe algebraic expression for the policy statement to be applicable is:\n\n(A ∧ (B ∧ (C ∨ D ∨ E)))",
  "Blue_Shield_of_CA_93228": "Let P represent \"patient-activated external ambulatory event monitors (AEMs)\"\nLet A represent \"auto-activated external ambulatory event monitors (AEMs)\"\nLet C represent \"continuous ambulatory monitors that record and store information for periods longer than 48 hours\"\n\nThe algebraic expression representing the requirement for the policy to be applicable is:\n\nP OR A OR C\n\nThis means that the policy will be applicable if any of the following conditions are met:\n- Patient-activated external ambulatory event monitors are used\n- Auto-activated external ambulatory event monitors are used\n- Continuous ambulatory monitors that record and store information for periods longer than 48 hours are used",
  "Blue_Shield_of_CA_0446T": "I. CGM is medically necessary for individuals with insulin dependent diabetes AND the device includes an audible or tactile alarm for low glucose alerts.\n\nII. The use of implantable CGM devices for management of diabetes is investigational.",
  "Blue_Shield_of_CA_51925": "Let:\nM = presence or suspicion of malignancy\nE = emergent condition\nO = abnormal uterine bleeding criteria\nA = high likelihood of adenomyosis\nP = Chronic Pelvic Inflammatory Disease\nD = Endometriosis criteria\nF = Leiomyomata criteria\nH = Pelvic pain criteria\nR = Pelvic relaxation criteria\nC = Cervical Intraepithelial Neoplasia criteria\nG = Preventive gynecologic surgical intervention criteria\nU = unclear or inadequately documented clinical indications\n\nThe algebraic expression for all the requirements for this policy to be applicable using logical operators and variables is:\n[(M ∧ E) ∨ (O ∨ A ∨ P ∨ D ∨ F ∨ H ∨ R ∨ C ∨ G)] ∧ ¬U"
}
