{
  "Blue_Shield_of_CA_00170": "Let:\nA = Dental general anesthesia is performed in a hospital, outpatient surgery center, or a dental office which has met the requirements established by the Dental Board of California for the provision of general anesthesia.\nB = The dental procedure generally does not ordinarily require general anesthesia.\nC = The patient is less than seven years of age.\nD = The patient is developmentally disabled.\nE = The patient's health is compromised.\n\nThe algebraic expression for all the medically necessary criteria for this policy to be applicable is:\n(A ∧ B) ∧ ((C ∨ D ∨ E))",
  "Blue_Shield_of_CA_93228": " below for specific devices considered medically necessary) MAY be considered \nmedically necessary as a diagnostic aid for suspected arrhythmias or for evaluation of \nsymptomatic palpitations when ANY of the following criteria (1-7) are met:\nII. The individual has symptoms of palpitations, suspected arrhythmias, or syncope\nIII. A resting electrocardiogram (ECG) has not established a diagnosis\nIV. The individual is not taking medications that may cause the reported symptoms\nV. Standard monitoring techniques such as 24-hour ambulatory electrocardiogram (Holter \nmonitor) or an event monitor are inadequate or cannot be used due to the frequency of \nsymptoms\nVI. The individual has had a non-diagnostic 24-hour Holter monitor or event monitor study\nVII. The device conforms to the AEM Heartlist created by the Inter-Societal Accreditation \nCommission (IAC)\nVIII. Profesionally reviewed by a cardiologist\nIX. Conform to the AEM Heartlist\nX. Is prescribed following STANDARD Procedure.\nXI. Must no be used with any other device\n\nVariables:\nP - Patient-activated or auto-activated external ambulatory event monitors (AEMs) OR continuous ambulatory monitors\nS - Symptomatic palpitations\nA - Arrhythmias suspected\nR - Resting electrocardiogram (ECG)\nM - Medications causing symptoms\nT - Standard monitoring techniques inadequate\nN - Non-diagnostic Holter monitor or event monitor study\nC - Conform to AEM Heartlist\nV - Professionally reviewed by a cardiologist\nR - Prescribed following Standard procedure\nO - No other device used\n\nAlgebraic expression:\nP AND (S OR A OR F OR T OR N OR C OR V OR R OR O)",
  "Blue_Shield_of_CA_0446T": "Let A be the variable representing individuals with insulin-dependent diabetes requiring multiple daily doses of insulin, and let B be the variable representing the device including an audible or tactile alarm for low glucose alerts without patient intervention.\n\nThe algebraic expression for all the medically necessary criteria for this policy to be applicable is: \n\nA AND B",
  "Blue_Shield_of_CA_51925": "Let:\nA: The presence or suspicion of a malignancy is clearly indicated\nB: An emergent condition exists\nC: Abnormal uterine bleeding criteria are met\nD: High likelihood of adenomyosis criteria are met\nE: Chronic Pelvic Inflammatory Disease (PID) criteria are met\nF: Endometriosis criteria are met\nG: Leiomyomata (fibroid) criteria are met\nH: Pelvic pain criteria are met\nI: Pelvic relaxation (prolapse) criteria are met\nJ: Cervical Intraepithelial Neoplasia (CIN) criteria are met\nK: Preventive gynecologic surgical intervention criteria are met\n\nTherefore, the algebraic expression for all medically necessary criteria to be applicable is:\n\n(A AND B) OR (C OR D OR E OR F OR G OR H OR I OR J OR K)",
  "Blue_Shield_of_CA_77385": "Let's denote the variables and criteria as follows: \n\n- A: Left-sided breast cancer\n- B: Prior breast-conserving surgery\n- C1: Significant cardiac radiation exposure cannot be avoided using alternative radiotherapy\n- C2: IMRT dosimetry demonstrates significantly reduces cardiac target volume radiation exposure\n- C2a: With 3D-CRT, V25 ≥ 10 cm^3 \n- C2b: With IMRT, reduction in absolute heart volume receiving 25 Gy by at least 20%\n- D: Contraindication to hypofractionation\n- E: Individual has large breasts (>500 cc)\n- F: 3-dimensional conformal radiotherapy dosimetry results in hot spots\n- G: Hot spots can be avoided with IMRT\n- H: Radiotherapy is being given with curative intent for lung cancer\n- I: 3-D conformal radiotherapy will expose greater than 35% of normal lung tissue to more than a 20 Gy dose-volume\n- J: IMRT dosimetry demonstrates a reduction in the V20 to at least 10% below the V20 achieved with the 3-dimensional plan\n- K: Target volume is in close proximity to critical structures that must be protected\n- L1: Planned 3D-CRT exposure to critical adjacent structures is above normal tissue constraints\n- L2: Planned IMRT exposure to critical adjacent structures does not exceed normal tissue constraints\n- M: The same or immediately adjacent area has been previously irradiated and abutting portals must be established with high precision\n\nUsing logical operators and variables, the algebraic expression for the medically necessary criteria would be:\n\n(A AND B AND (C1 AND C2 AND (C2a AND C2b))) OR (D) OR (E AND F AND G) OR (H AND I AND J) OR ((K AND L1) OR L2 OR M)\n\nThis expression represents all the necessary criteria for the policy to be applicable.",
  "Blue_Shield_of_CA_77386": "Let:\n- A: IMRT is considered medically necessary\n- B: Dosimetric planning with standard 3-dimensional conformal radiotherapy predicts that the radiation dose to an adjacent organ would result in unacceptable normal tissue toxicity\n- C: IMRT is used to treat cancer of one or more specified locations\n- D: The target volume is in close proximity to critical structures that must be protected\n- E: Planned 3D-CRT exposure to critical adjacent structures is above normal tissue constraints\n- F: Planned IMRT exposure to these critical adjacent structures does not exceed normal tissue constraints\n- G: The same or immediately adjacent area has been previously irradiated and abutting portals must be established with high precision\n\nThe algebraic expression would be:\n\n(A ∧ (B ∧ (C ∧ D ∧ (E ∧ F)) ∨ (C ∧ G)) ∨ ¬A",
  "Blue_Shield_of_CA_43632": "Let:\nA = Documentation of criteria for initial bariatric procedure\nB = Failure of weight loss by conservative measures\nC = Evaluation and treatment of underlying causes of obesity and co-morbidities\nD = Psychosocial evaluation\nE = Completion of education and counseling\nF = No tobacco smoking for at least 6 weeks\nG = No ongoing alcohol or drug abuse\nH = Properly credentialed surgeon and hospital\nI = Repair of hiatal hernia if indicated\nJ = Investigational for preadolescent children\nK = Investigational for other bariatric surgery procedures\nL = Investigational for bariatric surgery contraindications\n\nThe algebraic expression for all the medically necessary criteria for this policy to be applicable would be:\n\nA AND B AND C AND D AND E AND F AND G AND H AND I AND (NOT J) AND (NOT K) AND (NOT L)",
  "Blue_Shield_of_CA_15820": "Let:\nP = Procedure meets the definition of reconstructive surgery\nM = Procedure is medically necessary\nA = Procedure results in only minimal improvement in appearance\nD = Treating surgeon provides sufficient documentation\n\nThe algebraic expression for all the medically necessary criteria for this policy to be applicable would be:\nP AND (NOT A OR D)",
  "Blue_Shield_of_CA_93454": " For this policy to be applicable, the following medically necessary criteria must be met:\n\nLet:\nA = Prior authorization of ICA for acute coronary syndrome (ACS) or other high-risk situations is addressed\n\nThe algebric expression is:\n\nA^n (n = not)",
  "Blue_Shield_of_CA_G6016": "Let:\nA: Intensity-modulated radiotherapy is considered medically necessary\nB: Dosimetric planning with standard 3D-CRT predicts unacceptable normal tissue toxicity\nC: Target volume is in close proximity to critical structures\nD: Planned 3D-CRT exposure to critical adjacent structures is above normal tissue constraints\nE: Planned IMRT exposure to critical adjacent structures does not exceed normal tissue constraints\nF: Area has been previously irradiated\nG: Pediatric CNS tumors\nH: Hippocampal-avoiding intensity-modulated radiotherapy is considered medically necessary\nI: Brain tumor metastases outside a 5-mm margin around either hippocampus\nJ: Expected survival of 4 months or longer\n\nAlgebraic expression:\nA = B ∨ ((C ∧ D ∧ E) ∨ F ∨ G)\nH = I ∧ J",
  "Blue_Shield_of_CA_92920": "policy statement.\n\nVariables:\nA = Prior authorization of ICA \nB = Acute coronary syndrome (ACS) \nC = High-risk situations\n\nAlgebraic Expression:\n(¬A) ∧ (B ∨ C)",
  "Blue_Shield_of_CA_27447": "Let:\nA = Arthroplasty is for osteoarthritis (OA), rheumatoid arthritis, osteonecrosis, or post-traumatic arthritis\nB = Arthroplasty is NOT for bicompartmental knee replacement\nC = Arthroplasty is NOT for a customized knee replacement \nC1 = Arthroplasty does NOT use customized knee implant\nC2 = Arthroplasty does NOT use a \"Gender specific\" implant\nD = Arthroplasty does NOT use focal resurfacing of a single knee joint defect\nE = Arthroplasty does NOT use minimally invasive approaches\nF = The individual has one of the specified conditions\nF1 = Degenerative joint disease with unsuccessful conservative therapy and limited range of motion\nF2 = Distal femur fracture repair in an individual with osteoporosis\nF3 = Failure of previous osteotomy\nF4 = Hemophilic arthroplasty\nF5 = Limb salvage for malignancy\nF6 = Posttraumatic knee joint destruction\nF7 = Replacement or revision of previous arthroplasty with specified conditions\n\nTherefore, the algebraic expression of all the medically necessary criteria for this policy to be applicable would be:\n(A & !B & !C & !C1 & !C2 & !D & !E & (F & (F1 & (F1a & F1b & F1c) | F2 | F3 | F4 | F5 | F6 | F7)))",
  "Blue_Shield_of_CA_11920": " variables:\nA = individual is age 18 or older\nG = confirmed gender dysphoria\n\nAlgebraic expression: A ∧ G",
  "Blue_Shield_of_CA_81201": "Let P represent \"genetic testing of the APC gene may be considered medically necessary\"\nLet Q represent \"genetic testing of the MUTYH gene may be considered medically necessary\"\nLet R represent \"genetic testing for Lynch Syndrome (LS), MMR genes (MLH1, MSH2, MSH6, PMS2), and EPCAM gene may be considered medically necessary\"\nLet S represent \"genetic testing of SMAD4 and BMPR1A genes may be considered medically necessary\"\nLet T represent \"genetic testing for STK11 gene variants may be considered medically necessary\"\nLet U represent \"limited genetic panels may be considered medically necessary\"\n\nThe algebraic expression would be:\n(P ∧ ((A ∨ B ∨ C ∨ D) ∨ II ∨ III)) ∨ (Q ∧ ((A ∨ B ∨ C) ∨ V)) ∨ (R ∧ ((A ∨ B ∨ C ∨ D ∨ E ∨ F ∨ G ∨ H ∨ I) ∨ VII ∨ VIII)) ∨ (S ∧ ((A ∨ B ∨ C) ∨ X)) ∨ (T ∧ ((A ∨ B) ∨ XII)) ∨ (U ∧ ((A ∨ B ∨ C) ∨ XIII))",
  "Blue_Shield_of_CA_81406": "Let A = Known Familial Variant Analysis for Cardiac Disorders \nLet B = Targeted Mutation Analysis for a Known Familial Variant \nLet C = Comprehensive Cardiomyopathy Panels \nLet D = Comprehensive Arrhythmia Panels \nLet E = Genomic Unity Cardiac Ion Channelopathies Analysis \nLet F = Comprehensive Arrhythmia & Cardiomyopathy Panels \nLet G = Hypertrophic Cardiomyopathy Panels \nLet H = Dilated Cardiomyopathy Panels\n\nThe algebraic expression for all the medically necessary criteria for this policy to be applicable is:\n\n(A OR B OR C OR D OR E OR F OR G OR H)",
  "Blue_Shield_of_CA_81415": "Let:\nE = Exome sequencing\nG = Genome sequencing\n\nThe algebraic expression for all the medically necessary criteria for this policy to be applicable using logical operators and variables is:\n\n(E or G) and (0214U or 0215U or 81415 or 81416 or 81417 or 0094U or 0212U or 0213U or 81425 or 81426 or 81427 or 0012U or 0209U or 0265U)",
  "Blue_Shield_of_CA_21085": "Let $P$ represent the statement \"Orthognathic surgery may be considered medically necessary and reconstructive.\"\n\nLet $A$ represent the statement \"An abnormal structure of the maxilla and mandible caused by accidental injury, congenital defect, developmental abnormality, disease, infection, or trauma.\"\n\nLet $B$ represent the statement \"Abnormal function of the maxilla and mandible exclusive of functional abnormalities of the teeth and occlusion.\"\n\nLet $C$ represent the statement \"Facial skeletal deformities are not correctable with non-surgical modalities.\"\n\nLet $D$ represent the statement \"Documentation that orthodontic treatment is completed or is not required.\"\n\nLet $E$ represent the statement \"Documentation that clearly shows discrepancies based on tooth position measurements.\"\n\nLet $F$ represent the statement \"Presence of a transverse skeletal discrepancy, vertical facial skeletal deformity, open bite, deep overbite, supra-eruption, or asymmetries.\"\n\nThe algebric expression including logical operators can be represented as:\n\n$P \\Leftrightarrow ((A \\lor B) \\land C \\land D \\land E \\land F)$",
  "Blue_Shield_of_CA_19328": " below for algebraic expression)\n\nLet variables:\n - A: Infection\n - B: Implant exposure/extrusion through skin\n - C: Baker Class IV capsular contracture\n\nThen the algebraic expression for all the medically necessary criteria for this policy to be applicable using logical operators would be:\n\n(A OR B OR C)",
  "Blue_Shield_of_CA_11950": "Variables:\nA = Procedure will result in only minimal improvement in appearance\nB = Treating surgeon cannot or will not provide sufficient documentation\n\nAlgebraic Expression:\n~(A ∨ B)",
  "Blue_Shield_of_CA_19318": "Let A = surgery performed to correct or repair abnormal structures of the body\nLet B = congenital defects, developmental abnormalities, trauma, infection, tumors, or disease\nLet C = create a normal appearance to the extent possible\nLet D = improve function\nLet E = likely to result in only minimal improvement in appearance\nLet F = sufficient documentation provided\n\nThe algebraic expression for all medically necessary criteria for this policy to be applicable is:\n\n(A ∧ B) ∧ ((C ∨ D) ∧ (¬E ∨ F))",
  "Blue_Shield_of_CA_21685": "This policy is applicable only if:\n- The patient is diagnosed with a medical condition that requires treatment.\n- The treatment is deemed medically necessary by a licensed healthcare provider.\n- The treatment is included in the patient's insurance coverage. \n\nAlgebraic expression:\nLet P = Patient's medical condition requires treatment\nLet T = Treatment is deemed medically necessary\nLet I = Treatment is included in insurance coverage\n\nThe policy is applicable if (P AND T AND I)",
  "Blue_Shield_of_CA_33927": "Let:\n- V = Implantable VADs with FDA approval or clearance may be considered medically necessary\n- T = Total artificial hearts (TAHs) with FDA approved devices may be considered medically necessary\n- A = Individual meets all criteria for bridge to heart transplantation\n- C = Individual meets all criteria for destination therapy\n- R = Individual meets criteria for postcardiotomy setting/bridge to recovery\n- I = Other applications of implantable VADs or TAHs are considered investigational\n- P = Percutaneous ventricular assist devices (pVADs) are considered investigational\n\nTherefore, the algebraic expression of all the medically necessary criteria for this policy to be applicable is:\n(V ∧ A) ∨ (V ∧ C) ∨ (T ∧ A) ∨ (V ∧ R) ∨ (T ∧ R) ∨ I ∨ P",
  "Blue_Shield_of_CA_36465": "Let:\nA = Use of surgery (ligation and stripping)\nB = Use of radiofrequency endovenous thermal ablation\nC = Use of laser endovenous thermal ablation\nD = Use of microfoam sclerotherapy\nE = Use of cyanoacrylate adhesion\nF = Demonstrated saphenous reflux with CEAP class C2 or greater\nG = Ulceration secondary to venous stasis, recurrent superficial thrombophlebitis, hemorrhage from a ruptured superficial varicosity, persistent symptoms interfering with daily activities, and conservative management for at least 6 weeks not improving symptoms\nH = Treatment of saphenous veins by surgery, endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesion that meets criteria\nI = Investigational treatment of saphenous veins not meeting criteria\nJ = Combined use of any two medically necessary treatments on the same vein or same type of vein\nK = Investigational use of sclerotherapy techniques other than microfoam sclerotherapy for great, small, or accessory saphenous veins\nL = Use of stab avulsion, hook phlebectomy, or transilluminated powered phlebectomy for saphenous veins is investigational\nM = Tributary varicosity treatment criteria being met\nN = Use of standard sclerotherapy for tributary varicosity treatment\nO = Investigational use of microfoam sclerotherapy or cyanoacrylate for treating tributary varicosities\nP = Investigational use of microfoam sclerotherapy or cyanoacrylate for treating tributary varicosities separately from saphenous vein treatment\nQ = Investigational treatment of isolated tributary veins without prior or concurrent saphenous vein treatment\nR = Investigational treatment of symptomatic varicose tributaries using techniques other than those noted\nS = Investigational use of endovenous radiofrequency or laser ablation for tributary veins\nT = Perforator vein treatments for leg ulcers\nU = Demonstrated perforator reflux\nV = Previous elimination of superficial saphenous veins\nW = Presence of ulcers that have not resolved following combined superficial vein treatment and compression therapy for at least 3 months\nX = Venous insufficiency not secondary to deep venous thromboembolism\nY = Investigational use of stab avulsion, hook phlebectomy, or transilluminated powered phlebectomy for perforator veins\nZ = Investigational treatment of telangiectasia less than 3 millimeters in diameter\nAA = Investigational use of mechanochemical ablation (MOCA) of any vein\nAB = Investigational use of endovenous cryoablation of any vein\n\nNow, using these variables and logical operators, the algebraic expression for all the medically necessary criteria for the policy to be applicable would be:\n\n(F AND (A OR B OR C OR D OR E)) AND (G AND H) AND (NOT I) AND (NOT J) AND (NOT K) AND (NOT L) AND (M AND N AND O AND P AND NOT Q AND NOT R AND NOT S) AND (T AND U AND V AND W AND X) AND (NOT Y) AND (NOT Z) AND (NOT AA) AND (NOT AB)",
  "Blue_Shield_of_CA_0524T": "Let:\nA = Documentation to use only one of the following procedures (not combined use of different procedures or an unlisted procedure): surgery (ligation and stripping), radiofrequency endovenous thermal ablation, laser endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesion\nB = There is demonstrated saphenous reflux and CEAP (Clinical, Etiology, Anatomy, Pathophysiology) class C2 or greater\nC = There is documentation of one or more of the following:\n1. Ulceration secondary to venous stasis\n2. Recurrent superficial thrombophlebitis\n3. Hemorrhage or recurrent bleeding episodes from a ruptured superficial varicosity\n4. Persistent pain, swelling, itching, burning, or other symptoms are associated with saphenous reflux, and both of the following:\n   a. The symptoms significantly interfere with activities of daily living\n   b. Conservative management including compression therapy for at least 6 weeks has not improved the symptoms\n\nThen, the algebraic expression of all the medically necessary criteria for this policy to be applicable is:\nA AND B AND C",
  "Blue_Shield_of_CA_36466": "Let:\nA = use of surgery, radiofrequency endovenous thermal ablation, laser endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesion\nB = presence of saphenous reflux and CEAP class C2 or greater\nC = presence of ulceration secondary to venous stasis, recurrent superficial thrombophlebitis, hemorrhage or recurrent bleeding episodes from a ruptured superficial varicosity, or persistent pain, swelling, itching, burning, or other symptoms associated with saphenous reflux interfering with daily activities and not improved by compression therapy for at least 6 weeks\n\nThe algebraic expression for all medically necessary criteria for saphenous vein treatment to be applicable would be:\n\nA AND B AND C",
  "Blue_Shield_of_CA_36471": "Let \n- S: Saphenous vein treatment may be considered medically necessary \n- D: Documentation to use only one of the specified procedures \n- R: Demonstrated saphenous reflux and CEAP class C2 or greater \n- U: Ulceration secondary to venous stasis \n- T: Recurrent superficial thrombophlebitis \n- H: Hemorrhage or recurrent bleeding episodes from a ruptured superficial varicosity \n- P: Persistent pain, swelling, itching, burning, or other symptoms associated with saphenous reflux, significantly interfere with activities of daily living, and conservative management has not improved the symptoms \n\nThe algebraic expression is: \nS = D ∧ R ∧ (U ∨ T ∨ H ∨ P)",
  "Blue_Shield_of_CA_36470": "Let:\n- PS: Saphenous vein treatment is medically necessary\n- P: Use only one of the following procedures: surgery, radiofrequency endovenous thermal ablation, laser endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesion\n- Q: Demonstrated saphenous reflux and CEAP class C2 or greater\n- R: Documentation of ulceration, recurrent superficial thrombophlebitis, hemorrhage, or persistent symptoms\n- S: Symptoms significantly interfere with daily activities and conservative management has not improved symptoms\n\nThen, the algebraic expression of all the medically necessary criteria for this policy to be applicable is:\nPS = P ∧ Q ∧ R ∧ S",
  "Blue_Shield_of_CA_36475": "Let:\nS = Surgery (ligation and stripping)\nRFA = Radiofrequency endovenous thermal ablation\nLETA = Laser endovenous thermal ablation\nMS = Microfoam sclerotherapy\nCA = Cyanoacrylate adhesion\nSVT = Saphenous vein treatment\nSR = Saphenous reflux\nC = CEAP class C2 or greater\nU = Ulceration secondary to venous stasis\nRST = Recurrent superficial thrombophlebitis\nH = Hemorrhage or recurrent bleeding episodes from a ruptured superficial varicosity\nSS = Persistent pain, swelling, itching, burning, associated with saphenous reflux interfering with activities of daily living\nCM = Conservative management not improving symptoms\nSVNMT = Saphenous veins treatment not meeting criteria\nMT = Medically necessary treatment combining\nST = Sclerotherapy techniques (other than microfoam sclerotherapy)\nTS = Tributary varicosity treatment\nTVT = Treatment of varicose tributaries\nLTS = Leftover product during the same session as saphenous vein treatments using the same agent\nSFT = Symptomatic varicose tributaries treatment\nIVT = Investigational treatment\nITV = Isolated tributary veins treatment\nTV = Treatment of isolated symptomatic varicose tributaries\nIRFLA = Endovenous radiofrequency or laser ablation of tributary veins\nPV = Perforator veins treatment\nPVL = Perforator vein treatments for leg ulcers\nPR = Perforator reflux\nSSV = Superficial saphenous veins\nU3 = Ulcers present for at least 3 months that have not resolved\nVD = Venous insufficiency not secondary to deep venous thromboembolism\nSP = Stab avulsion, hook phlebectomy, transilluminated powered phlebectomy\nT = Telangiectasia treatment\n\nTherefore, the algebraic expression of all the medically necessary criteria for this policy to be applicable is:\n(SVT AND (S OR RFA OR LETA OR MS OR CA) AND SR AND C AND (U OR RST OR H OR (SS AND (SS AND (CM AND SS))) AND TS AND (A AND (ST OR MT)) AND TVT AND (SVNMT OR IVT OR (IVT AND IVT)) AND SFT AND ((MT AND LTS) OR (MT AND LTS)) AND ((SFT AND LTS) OR (SFT AND LTS)) AND (TV OR ITVT OR (ITVT AND TV)) AND (PV AND (S OR LETA OR RFA OR MS OR CA)) AND PR AND SSV AND U3 AND VD AND (SP OR (U3 AND U3))) OR (T AND U3) OR (TV AND (U3 OR (U3 OR U3)) AND LTS) OR T OR (PVL AND PR AND SSV AND PVL AND U3 AND VD) OR PV OR (PV AND ((PR AND PV) OR ITVT OR TV)) OR T OR (T AND TV OR PV) OR (T AND PV) OR (T AND PV)",
  "Blue_Shield_of_CA_36468": "Let:\nA = Documentation to use only one of the following procedures (not combined use of different procedures or an unlisted procedure): surgery (ligation and stripping), radiofrequency endovenous thermal ablation, laser endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesion\nB = There is demonstrated saphenous reflux and CEAP class C2 or greater\nC = Documentation of ulceration secondary to venous stasis, recurrent superficial thrombophlebitis, hemorrhage or recurrent bleeding episodes from a ruptured superficial varicosity, or persistent pain, swelling, itching, burning, or other symptoms associated with saphenous reflux, and both of the following being true:\n- The symptoms significantly interfere with activities of daily living\n- Conservative management including compression therapy for at least 6 weeks has not improved the symptoms\n\nTherefore, the algebraic expression for all the medically necessary criteria to be applicable would be:\nA ∧ B ∧ (C)",
  "Blue_Shield_of_CA_36473": "Let \nA = Documentation to use only one of the following procedures (not combined use of different procedures or an unlisted procedure): surgery (ligation and stripping), radiofrequency endovenous thermal ablation, laser endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesion\nB = There is demonstrated saphenous reflux and CEAP (Clinical, Etiology, Anatomy, Pathophysiology) class C2 or greater\nC = There is documentation of one or more of the following:\n1. Ulceration secondary to venous stasis\n2. Recurrent superficial thrombophlebitis\n3. Hemorrhage or recurrent bleeding episodes from a ruptured superficial varicosity\n4. Persistent pain, swelling, itching, burning, or other symptoms are associated with saphenous reflux, and both of the following:\na. The symptoms significantly interfere with activities of daily living\nb. Conservative management including compression therapy for at least 6 weeks has not improved the symptoms\n\nThe algebraic expression for all the medically necessary criteria for this policy to be applicable is:\nA AND B AND (C1 OR C2 OR C3 OR C4)",
  "Blue_Shield_of_CA_36474": "Let:\nA = Documentation for surgery (ligation and stripping)\nB = Documentation for radiofrequency endovenous thermal ablation\nC = Documentation for laser endovenous thermal ablation\nD = Documentation for microfoam sclerotherapy\nE = Documentation for cyanoacrylate adhesion\nF = Demonstrated saphenous reflux and CEAP class C2 or greater\nG = Ulceration secondary to venous stasis\nH = Recurrent superficial thrombophlebitis\nI = Hemorrhage or recurrent bleeding episodes from a ruptured superficial varicosity\nJ = Persistent pain, swelling, itching, burning, or other symptoms associated with saphenous reflux\nK = Symptoms significantly interfere with activities of daily living\nL = Conservative management for at least 6 weeks has not improved symptoms\nM = Treatment by surgery, endovenous thermal ablation (radiofrequency or laser), microfoam sclerotherapy, or cyanoacrylate adhesive is investigational\nN = Combining two medically necessary treatments during the same session on the same vein or type of vein is not medically necessary.\nO = Sclerotherapy techniques (other than microfoam sclerotherapy) as the primary treatment of great, small, or accessory saphenous veins is investigational\nP = Stab avulsion, hook phlebectomy, or transilluminated powered phlebectomy of perforator veins are investigational\nQ = Tributary varicosity treatment criteria is met\nR = Tributaries are symptomatic\nS = Use of microfoam sclerotherapy or cyanoacrylate only when using leftover product during the same session as saphenous vein treatments using the same agent\nT = Investigation when microfoam sclerotherapy or cyanoacrylate are used separately from saphenous vein treatment\nU = Investigation of treatment of isolated tributary veins without prior or concurrent treatment of saphenous veins\nV = Investigation of isolated treatment of symptomatic varicose tributaries using other techniques\nW = Investigation of endovenous radiofrequency or laser ablation of tributary veins\nX = Demonstrated perforator reflux\nY = Superficial saphenous veins have been previously eliminated\nZ = Ulcers have not resolved following combined superficial vein treatment and compression therapy for at least 3 months\nAA = Venous insufficiency is not secondary to deep venous thromboembolism\nAB = Investigation of stab avulsion, hook phlebectomy, or transilluminated powered phlebectomy of perforator veins\nAC = Investigation of treatment of telangiectasia less than 3 millimeters in diameter\nAD = Investigation of mechanochemical ablation (MOCA) of any vein\nAE = Investigation of endovenous cryoablation of any vein\n\nThe algebraic expression for all the medically necessary criteria for this policy to be applicable is:\n\n(A or B or C or D or E) and F and (G or H or I or (J and K and L)) and not M and not N and not O and P and Q and R and (S or T or (U and V) or W) and X and Y and Z and AA and not AB and not AC and not AD and not AE",
  "Blue_Shield_of_CA_36476": "Let:\nA = Use of surgery (ligation and stripping)\nB = Use of radiofrequency endovenous thermal ablation\nC = Use of laser endovenous thermal ablation\nD = Use of microfoam sclerotherapy\nE = Use of cyanoacrylate adhesion\nF = Demonstrated saphenous reflux and CEAP class C2 or greater\nG = Documentation of ulceration, thrombophlebitis, hemorrhage, or persistent symptoms\nH = Symptoms significantly interfere with activities of daily living\nI = Conservative management for at least 6 weeks has not improved symptoms\nJ = Combining two medically necessary treatments during the same session is not allowed\nK = Sclerotherapy techniques (other than microfoam sclerotherapy) as primary treatment is investigational\nL = Standard foam sclerotherapy can be used for cleanup of small sections of saphenous veins\nM = Stab avulsion, hook phlebectomy, or transilluminated powered phlebectomy of perforator veins is investigational\nN = Tributaries are symptomatic\nO = Successful or planned treatment of saphenous veins\nP = All tributaries in the same leg meeting criteria for treatment will be treated in the same session\nQ = Use of microfoam sclerotherapy or cyanoacrylate only when using leftover product during the same session\nR = Use of microfoam sclerotherapy or cyanoacrylate to treat varicose tributaries is investigational when done separately from saphenous vein treatment\nS = Treatment of isolated tributary veins without prior or concurrent treatment of saphenous veins is investigational\nT = Isolated treatment of symptomatic varicose tributaries using techniques other than those noted is investigational\nU = Endovenous radiofrequency or laser ablation of tributary veins is investigational\nV = Demonstrated perforator reflux\nW = Any superficial saphenous veins have been previously eliminated\nX = Presence of ulcers that have not resolved following combined superficial vein treatment and compression therapy for at least 3 months\nY = Venous insufficiency is not secondary to deep venous thromboembolism\nZ = Treatment of telangiectasia less than 3 millimeters in diameter is investigational\nAA = Mechanochemical ablation of any vein is investigational\nAB = Endovenous cryoablation of any vein is investigational\n\nThe expression for all medically necessary criteria for the policy to be applicable can be written as:\n\n(F AND ((A OR B OR C OR D OR E) AND G AND (1 OR 2 OR 3 OR (4 AND H AND I))) AND (NOT J) AND (NOT K) AND L) OR (V AND W AND X AND Y)\n\nThis expression represents all the necessary criteria outlined in the policy statement using logical operators and variables.",
  "Blue_Shield_of_CA_36478": "Let:\nA = Use of surgery (ligation and stripping)\nB = Use of radiofrequency endovenous thermal ablation\nC = Use of laser endovenous thermal ablation\nD = Use of microfoam sclerotherapy\nE = Use of cyanoacrylate adhesion\nF = Demonstrated saphenous reflux and CEAP class C2 or greater\nG = Ulceration secondary to venous stasis\nH = Recurrent superficial thrombophlebitis\nI = Hemorrhage or recurrent bleeding episodes from a ruptured superficial varicosity\nJ = Persistent pain, swelling, itching, burning, or other symptoms associated with saphenous reflux, and interfere with activities of daily living\nK = Conservative management including compression therapy for at least 6 weeks has not improved symptoms\n\nThen the algebraic expression for all medically necessary criteria for saphenous vein treatment to be applicable is:\n(A OR B OR C OR D OR E) AND (F) AND ((G) OR (H) OR (I) OR (J AND K))\n\nThis expression represents that at least one procedure must be used (A, B, C, D, or E), there must be demonstrated saphenous reflux and CEAP class C2 or greater (F), and there must be documentation of at least one of the specified conditions (G, H, I, or symptoms associated with saphenous reflux interfering with daily activities and not improved with conservative management).",
  "Blue_Shield_of_CA_36479": "Let:\nA = Documentation to use only one of the following procedures (not combined use of different procedures or an unlisted procedure): surgery (ligation and stripping), radiofrequency endovenous thermal ablation, laser endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesion\nB = There is demonstrated saphenous reflux and CEAP (Clinical, Etiology, Anatomy, Pathophysiology) class C2 or greater\nC = There is documentation of one or more of the following:\n1. Ulceration secondary to venous stasis\n2. Recurrent superficial thrombophlebitis\n3. Hemorrhage or recurrent bleeding episodes from a ruptured superficial varicosity\n4. Persistent pain, swelling, itching, burning, or other symptoms are associated with saphenous reflux, and both of the following:\na. The symptoms significantly interfere with activities of daily living\nb. Conservative management including compression therapy for at least 6 weeks has not improved the symptoms\n\nThen, the algebraic expression for all the medically necessary criteria for saphenous vein treatment to be applicable would be:\n(A) AND (B) AND (C)",
  "Blue_Shield_of_CA_36482": "Let:\nA - Documentation to use only one of the specified procedures\nB - Demonstrated saphenous reflux and CEAP class C2 or greater\nC - Documentation of ulceration, thrombophlebitis, hemorrhage, or persistent symptoms interfering with daily living\nD - Symptomatic tributaries with successful saphenous vein treatment\nE - Use of microfoam sclerotherapy or cyanoacrylate only when using leftover product\nF - Treatment of perforator veins for leg ulcers\nG - Demonstration of perforator reflux with resolved superficial saphenous veins and persistent ulcers\nH - Telangiectasia less than 3 millimeters in diameter\nI - Investigational treatments or procedures\n\nThe algebraic expression for all the medically necessary criteria for the policy to be applicable is:\nA AND B AND C AND D AND E AND (F AND G) AND H NOT I",
  "Blue_Shield_of_CA_36483": "Let's define the following variables:\n\n- A: Documentation to use only one of the following procedures (not combined use of different procedures or an unlisted procedure)\n- B: Demonstrated saphenous reflux and CEAP class C2 or greater\n- C1: Ulceration secondary to venous stasis\n- C2: Recurrent superficial thrombophlebitis\n- C3: Hemorrhage or recurrent bleeding episodes from a ruptured superficial varicosity\n- C4: Persistent pain, swelling, itching, burning, or other symptoms associated with saphenous reflux, and both symptoms a. interferes with activities of daily living and b. conservative management has not improved symptoms\n- IV: Sclerotherapy techniques as the primary treatment of great, small, or accessory saphenous veins is considered investigational\n- V: Stab avulsion, hook phlebectomy, or transilluminated powered phlebectomy of perforator, great, small, or accessory saphenous veins are considered investigational\n- VI: Tributary varicosity treatment when performed either at the same time or following prior treatment as saphenous vein treatment may be considered medically necessary\n- VII: Use of microfoam sclerotherapy or cyanoacrylate to treat symptomatic varicose tributaries is considered investigational when done separately from saphenous vein treatment\n- VIII: Treatment of isolated tributary veins without prior or concurrent treatment of saphenous veins, isolated treatment of symptomatic varicose tributaries using any other techniques, and endovenous radiofrequency or laser ablation of tributary veins are considered investigational\n- IX: Perforator vein treatments for leg ulcers may be considered medically necessary under certain conditions\n- X: Stab avulsion, hook phlebectomy, transilluminated powered phlebectomy of perforator veins are considered investigational\n- XI: Treatment of telangiectasia less than 3 millimeters in diameter are considered investigational\n- XII: Mechanochemical ablation (MOCA) of any vein and endovenous cryoablation of any vein are considered investigational\n\nNow we can write the algebraic expression using logical operators:\nI. A AND B AND (C1 OR C2 OR C3 OR C4)\nII. NOT(A AND B AND (C1 OR C2 OR C3 OR C4))\nIII. NOT((A AND B) OR (A AND C1) OR (B AND C1))\nIV. IV\nV. V\nVI. A AND (B AND C AND D AND E)\nVII. NOT((A AND B) OR (A AND C) OR (B AND C))\nVIII. NOT((A AND B) OR (A AND C) OR (A AND D) OR (B AND C) OR (B AND D) OR (C AND D))\nIX. A AND B AND C AND D\nX. X\nXI. NOT(less than 3 millimeters in diameter)\nXII. (A AND B) OR (A AND C)\n\nThese expressions represent the medically necessary criteria for policy applicability according to the provided policy statement.",
  "Blue_Shield_of_CA_37500": "Let's define the variables as follows:\nS = Saphenous vein treatment\nP = Procedure used (surgery, radiofrequency ablation, laser ablation, microfoam sclerotherapy, cyanoacrylate adhesion)\nR = Saphenous reflux and CEAP class C2 or greater\nD = Documentation of one or more symptoms (ulceration, thrombophlebitis, hemorrhage, pain/swelling/itching/burning)\nA = Symptoms significantly interfere with activities of daily living\nC = Conservative management for 6 weeks has not improved symptoms\nT = Treatment of saphenous veins is investigational\nN = Combining two treatments is not medically necessary\n\nNow, we can formulate the expression as follows:\nS -> P ∧ R ∧ (D ∧ (A ∧ C)) ∨ T ∨ N",
  "Blue_Shield_of_CA_37700": "Let:\nA = Documentation to use only one of the following procedures (not combined use of different procedures or an unlisted procedure): surgery (ligation and stripping), radiofrequency endovenous thermal ablation, laser endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesion\nB = There is demonstrated saphenous reflux and CEAP class C2 or greater\nC = There is documentation of one or more of the following: ulceration secondary to venous stasis, recurrent superficial thrombophlebitis, hemorrhage or recurrent bleeding episodes from a ruptured superficial varicosity, persistent pain, swelling, itching, burning, or other symptoms associated with saphenous reflux, and both of the following: a. The symptoms significantly interfere with activities of daily living b. Conservative management including compression therapy for at least 6 weeks has not improved the symptoms\n\nTherefore, the algebraic expression for all the medically necessary criteria for this policy to be applicable would be:\nA AND B AND C",
  "Blue_Shield_of_CA_37718": "Let:\nS = Saphenous vein treatment\nP = Procedure\nR = Saphenous reflux\nC = CEAP class C2 or greater\nU = Ulceration\nT = Recurrent thrombophlebitis\nH = Hemorrhage or bleeding\nPain = Persistent pain, swelling, itching, burning, or other symptoms\nADL = Activities of daily living\nCM = Conservative management \nIVT = Investigational treatment\nF = Sclerotherapy\nIVF = Investigational foam sclerotherapy\nST = Symptomatic tributaries\nPT = Tributary varicosity treatment\nSVT = Saphenous vein treatment\nTreat = Varicose veins/Venous insufficiency treatment\nTV = Tributary treatment\nSTV = Symptomatic tributaries treatment\nIVST = Investigational sclerotherapy techniques\nIST = Isolated tributary veins treatment\nPTV = Perforator vein treatment\nUL = Leg ulcers\nSEPS = Subfascial Endoscopic Perforator Surgery\nDC = Deep venous thromboembolism\nM = Telangiectasia\nIVM = Investigational telangiectasia treatment\n\nThe algebraic expression of all the medically necessary criteria for this policy to be applicable:\n(S ∧ (P = surgery ∨ P = RFA ∨ P = laser ∨ P = microfoam ∨ P = cyanoacrylate)) ∧ (R ∧ C) ∧ ((U ∨ T ∨ H ∨ (Pain ∧ (ADL ∧ ¬ (CM ≥ 6 weeks)))) ∧ (STV ∧ Treat)) ∧ (TV ∨ (PT ∧ (P = stab avulsion ∨ P = hook phlebectomy ∨ P = sclerotherapy ∨ P = transilluminated phlebectomy)) ∧ (SVT ∨ T)) ∧ (IVT) ∧ (IVF) ∧ (IVST) ∧ (IST) ∧ (IVPTV) ∧ (((F = microfoam ∨ F = cyanoacrylate) ∧ SVT) ∨ IVST)) ∧ (IVM)",
  "Blue_Shield_of_CA_37722": "Let:\nA = Use of surgery (ligation and stripping)\nB = Use of radiofrequency endovenous thermal ablation\nC = Use of laser endovenous thermal ablation\nD = Use of microfoam sclerotherapy\nE = Use of cyanoacrylate adhesion\nF = Demonstrated saphenous reflux and CEAP class C2 or greater\nG = Ulceration secondary to venous stasis, recurrent superficial thrombophlebitis, hemorrhage or recurrent bleeding episodes from a ruptured superficial varicosity, or persistent pain, swelling, itching, burning, or other symptoms associated with saphenous reflux with interference in activities of daily living after failed conservative management\nH = Use of microfoam sclerotherapy for cleanup of small sections after primary treatment\nI = Treatment of tributary varicosity following successful saphenous vein treatment\nJ = All tributaries in the same leg meeting criteria for treatment will be treated in the same session\nK = Use of microfoam sclerotherapy or cyanoacrylate only when using leftover product during the same session as saphenous vein treatments using the same agent\nL = Treatment of perforator veins for leg ulcers\nM = Treatment of telangiectasia less than 3mm in diameter\nN = Demonstrated perforator reflux, all superficial saphenous veins previously eliminated, presence of ulcers not resolved after 3 months of treatment, and venous insufficiency not due to deep venous thromboembolism\n\nThen the algebraic expression for all medically necessary criteria to be applicable is:\n(A OR B OR C OR D OR E) AND F AND (G OR H) AND I AND J AND K AND L AND M AND N",
  "Blue_Shield_of_CA_37735": "Let:\nP = Documentation to use only one of the following procedures (not combined use of different procedures or an unlisted procedure): surgery (ligation and stripping), radiofrequency endovenous thermal ablation, laser endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesion\nQ = There is demonstrated saphenous reflux and CEAP class C2 or greater\nR = Ulceration secondary to venous stasis\nS = Recurrent superficial thrombophlebitis\nT = Hemorrhage or recurrent bleeding episodes from a ruptured superficial varicosity\nU = Persistent pain, swelling, itching, burning, or other symptoms are associated with saphenous reflux\nV = The symptoms significantly interfere with activities of daily living\nW = Conservative management including compression therapy for at least 6 weeks has not improved the symptoms\n\nThe algebraic expression for all the medically necessary criteria for saphenous vein treatment to be applicable using logical operators and variables is:\nP ∧ Q ∧ (R ∨ S ∨ T ∨ (U ∧ V ∧ W))",
  "Blue_Shield_of_CA_37760": "Let:\nA = Documentation to use only one of the following procedures: surgery (ligation and stripping), radiofrequency endovenous thermal ablation, laser endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesion\nB = Saphenous reflux and CEAP class C2 or greater\nC = Documentation of: \n1. Ulceration secondary to venous stasis\n2. Recurrent superficial thrombophlebitis\n3. Hemorrhage or recurrent bleeding episodes from a ruptured superficial varicosity\n4. Persistent pain, swelling, itching, burning, or other symptoms associated with saphenous reflux, and both of the following:\n    i. The symptoms significantly interfere with activities of daily living\n    ii. Conservative management including compression therapy for at least 6 weeks has not improved the symptoms\n\nThen, the algebraic expression for all the medically necessary criteria for saphenous vein treatment policy is:\nA AND B AND C\n\nWhere AND represents the logical operator 'and'.",
  "Blue_Shield_of_CA_37765": "Let:\nA = Documentation to use only one of the specified procedures\nB = Demonstrated saphenous reflux and CEAP class C2 or greater\nC = Documentation of ulceration, thrombophlebitis, hemorrhage, or persistent pain symptoms\nD = Symptoms significantly interfere with activities of daily living and conservative management has not improved symptoms\nE = Treatment of saphenous veins by surgery, endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesive is investigational\n\nThe algebraic expression for all the medically necessary criteria for saphenous vein treatment to be applicable can be written as:\n\nA AND B AND (C OR D) AND E",
  "Blue_Shield_of_CA_37766": "Let:\nA: Documentation to use only one of the specified procedures\nB: Demonstrated saphenous reflux and CEAP class C2 or greater\nC: Documentation of ulceration, thrombophlebitis, hemorrhage, or persistent symptoms\nD: Symptoms significantly interfere with activities of daily living and conservative management has not improved symptoms\n\nThe algebraic expression for all the medically necessary criteria for saphenous vein treatment to be applicable is:\nA AND B AND (C OR D)",
  "Blue_Shield_of_CA_37780": "Let:\nA = Documentation to use only one of the following procedures \nS = Demonstrated saphenous reflux and CEAP class C2 or greater \nD = Documentation of ulceration, thrombophlebitis, hemorrhage, or persistent symptoms \nP = Treatment of saphenous veins by surgery, endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesive \nC = Combining multiple treatments \nM = Use of sclerotherapy techniques \nT = Tributary varicosity treatment \nV = Successful or concurrent treatment of saphenous veins \nL = Isolated tributary veins treatment \nU = Perforator vein treatments for leg ulcers \nE = Demonstrated perforator reflux \nR = Elimination of superficial saphenous veins \nG = Presence of ulcers \nI = Venous insufficiency not secondary to deep venous thromboembolism \nH = Treatment of telangiectasia \n\nThe algebraic expression for all the medically necessary criteria for this policy to be applicable is:\n(S AND A AND D AND P) OR (T AND V AND M) OR (U AND E AND R AND G AND I) OR H",
  "Blue_Shield_of_CA_37785": "Let:\nA = Documentation to use only one of the procedures (surgery, radiofrequency endovenous thermal ablation, laser endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesion)\nB = Demonstrate saphenous reflux and CEAP class C2 or greater\nC = Documentation of ulceration, recurrent superficial thrombophlebitis, hemorrhage or recurrent bleeding episodes, or persistent symptoms associated with saphenous reflux\nD = Symptoms significantly interfere with activities of daily living\nE = Conservative management including compression therapy for at least 6 weeks has not improved symptoms\n\nThe algebraic expression for all the medically necessary criteria for the policy statement to be applicable is:\n(A AND B AND C AND (D AND E))",
  "Blue_Shield_of_CA_37799": "Let:\nA = Documentation to use only one of the following procedures: surgery (ligation and stripping), radiofrequency endovenous thermal ablation, laser endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesion\nB = Demonstrated saphenous reflux and CEAP class C2 or greater\nC = Documentation of one or more of the following: ulceration secondary to venous stasis, recurrent superficial thrombophlebitis, hemorrhage or recurrent bleeding episodes from a ruptured superficial varicosity, persistent pain, swelling, itching, burning, or other symptoms associated with saphenous reflux, and symptoms significantly interfere with activities of daily living and conservative management including compression therapy for at least 6 weeks has not improved the symptoms\n\nThe algebraic expression of all the medically necessary criteria for the policy to be applicable would be:\n\n(A AND B AND C)",
  "Blue_Shield_of_CA_76942": "Let:\nA = Use of only one of the following procedures: surgery, radiofrequency endovenous thermal ablation, laser endovenous thermal ablation, microfoam sclerotherapy, or cyanoacrylate adhesion\nB = Demonstrated saphenous reflux and CEAP class C2 or greater\nC = Documentation of ulceration secondary to venous stasis, recurrent superficial thrombophlebitis, hemorrhage or recurrent bleeding episodes from a ruptured superficial varicosity, or persistent symptoms associated with saphenous reflux interfering with activities of daily living and not improved with conservative management\nD = Procedure for great, small, or accessory saphenous veins that does not meet criteria is investigational\nE = Combining two medically necessary treatments during the same session is not medically necessary\nF = Sclerotherapy techniques other than microfoam sclerotherapy for primary treatment is investigational\nG = Stab avulsion, hook phlebectomy, or transilluminated powered phlebectomy of saphenous veins are investigational\nH = Criteria for tributary varicosity treatment met\nI = Criteria for treatment of varicose tributaries separately from saphenous vein treatment met\nJ = Investigational treatments for isolated tributary veins or symptomatic varicose tributaries\nK = Investigational treatments for perforator veins\nL = Investigational treatments for telangiectasia\nM = Investigational treatments for Mechanochemical ablation (MOCA) or Endovenous cryoablation\n\nThen, the algebraic expression for all of the medically necessary criteria for this policy to be applicable would be:\n\n(A AND B AND C) OR (H AND I) AND NOT (D OR E OR F OR G OR J OR K OR L OR M)",
  "Blue_Shield_of_CA_93970": "Let:\nA = Documentation to use only one of the listed procedures\nB = Demonstrated saphenous reflux and CEAP class C2 or greater\nC = Documentation of ulceration, thrombophlebitis, hemorrhage, or persistent symptoms associated with saphenous reflux\nD = Symptoms significantly interfere with activities of daily living and conservative management has not improved\nE = Use of microfoam sclerotherapy or cyanoacrylate adhesive after saphenous vein treatments using the same agent\nF = Tributaries are symptomatic and all tributaries meeting criteria will be treated in the same session\nG = Perforator vein treatments for leg ulcers meet certain conditions\n\nThe algebric expression of all the medically necessary criteria for this policy to be applicable is:\n\n(A AND B AND C AND D AND E) OR (F AND G)",
  "Blue_Shield_of_CA_93971": "Let:\nA = Documentation to use only one of the specified procedures\nB = Demonstrated saphenous reflux and CEAP class C2 or greater\nC = Documentation of ulceration, thrombophlebitis, hemorrhage, or persistent symptoms associated with saphenous reflux\nD = Symptoms significantly interfere with activities of daily living and conservative management has not improved symptoms\n\nThe algebraic expression for all the medically necessary criteria for saphenous vein treatment to be applicable would be:\nA AND B AND C AND D\n\n(Note: The criteria must all be met for the treatment to be considered medically necessary)"
}